[
  {
    "slug": "bbq-peach-papers",
    "title": "BBQ Peach papers",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/BBQ-Peach-Paper-006.jpg",
    "cat": ["bbq-peach-papers"],
    "tags": [
      "bbq-peach-paper",
      "peach-paper-rolls",
      "peach-paper-sheets",
      "pink-butchers-paper"
    ],
    "excerpt": "<p>BBQ Peach Papers Wholesale. Pink / peach butcher paper retardsthe loss of moisture when cooking. It is approved for BBQs andsmoking meats, and it will not trap moisture. It allows the meatto breathe through the paper, ensuring a smoky flavor when usingto cook.</p><p>Get Latest Competitive Price.</p>",
    "desc": "<p><a href=\"/\">Double A Global</a> have Import& Export Right and International Trade Depart, which can be committed to providing professional service to our customer abroad. Through attending exhibitions domestically & abroad, we have learned and developed a lot by communication with our customers. Main products are as following: Parchment <a href=\"/\">Paper</a> Greaseproof Paper Glassine Paper Kraft Paper Butcher paper Specialty Foodstuff Wrapping Paper Acid free tissue paper BBQ Peach papers, also known as Pink/Peach Butcher Kraft Paper Roll, is a sturdy style of butcher paper that is engineered to offer excellent moisture holdout and strength. Peach paper, or pink butcher’s paper, is the beautiful pink paper we see wrapping meats at Barbecue Restaurants and Smokehouses.</p><h2>Why choose our BBQ Peach papers?</h2><p>1.Using our butcher paper to wrap meat like brisket prevent it from losing moisture towards to the end of the cooking period.</p><p>2.Our pink butcher paper can let the meat “breathe”a little,preventing the meat from textureless mush.</p><p>3.Our butcher paper can be used as a part of a”Texas crutch” to avoid dreaded BBQ Peach papers stall.</p><p>4.Our butcher paper is made of virgin woodpulp,uncoated,unwaxed,unbleached,100% safe.</p><p>5.Our butcher paper is available for 18 inch and 24 inch size for multiple applications.OEM is acceptable.</p><p>Description: Premium <a href=\"https://en.wikipedia.org/wiki/Butcher_paper\">Peach Paper</a></p><p>Stock: Peach Paper</p><p>GSM: 45gsm</p><p>Form: Sheets and Rolls</p><p>Print: Custom Print Available 1 or 2 color.</p><p>FINEST QUALITY:<br>There is no wax or polymer coating on the paper. We choose the finest pure virgin pulps to make our paper.</p><p>AUTHENTIC STYLE:<br>The paper protects the meat from the full assault of the smoker, while its high breathability property allows the steam to escape the wrapping, ensuring a firm crust on your smoked goods.</p><h2>Strong And Durability of BBQ Paper:</h2><p>MULTI-PURPOSE FOOD SERVING:<br>Beautiful natural peach tint has made it an excellent aesthetic choice for serving other types of food such as sandwiches, burgers, and fries etc.</p><p>It is highly popular among BBQ professionals for wrapping briskets and other meat for smoking. Although foil is a durable wrapping for smoking, it’s non-porous nature traps steam and moisture which condenses and can ruin the delicious crust on your meat. Our highly porous butcher paper solves these issues by allowing steam to escape while keeping the contents protected from the full assault of the smoker.</p><p>Contact us for more information here.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/BBQ-Peach-Paper-006.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/BBQ-Peach-Paper-004-1-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/BBQ-Peach-Paper-001.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/BBQ-Peach-Paper-005-600x479-1.jpg"
    ]
  },
  {
    "slug": "bleached-softwood-kraft-pulp-bskp",
    "title": "Bleached Softwood Kraft Pulp (BSKP)",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Bleached-Softwood-Kraft-Pulp-002.jpg",
    "cat": ["kraft-paper"],
    "tags": [
      "bleached-softwood-kraft-pulp",
      "bleached-softwood-kraft-pulp-exporters",
      "bleached-softwood-kraft-pulp-manufacturers",
      "kraft-pulp-paper"
    ],
    "excerpt": "<p>Bleached softwood kraft Pulp (BSKP) is a wood pulp. The main rawmaterials are slash pine, longleaf pine, shortleaf pine,loblolly pine and virginia pine.</p>",
    "desc": "<p>Bleached Softwood Kraft Pulp (BSKP) supply by us is known throughout the world as versatile pulp with uniform characteristics. It is used as a raw material in a range of products from printing and writing paper (coated or uncoated) to cardboards, tissue and other specialty products. <a class=\"tag-cloud-link tag-link-29 tag-link-position-17\" href=\"/product/bleached-softwood-kraft-pulp-bskp/\" aria-label=\"Buy online Laser Paper (19 items)\">Buy bleached softwood kraft pulp onlin</a></p><p data-spm-anchor-id=\"a2700.details.0.i24.4f834d6aOeGC5H\">Bleached Paper Pulp Bamboo Pulp</p><p>Bleached/Unbleached Hardwood/Softwood Pulp<br>We are a production-commercial company, based in Germany.<br>Manufacture, source, and export various materials for the printing industry.</p><p>Offer the following commodity:<br>1. Bleached Softwood Pulp<br>2. Bleached Hardwood Pulp<br>3.Unbleached Softwood Pulp<br>4. Unbleached Hardwood Pulp.</p><p>These are made from virgin, not recycled materials, and have different grades and types, which depend on<br>the end use. These include coniferous softwood pulp and deciduous (aspen) softwood pulp. In addition,<br>we can modify the composition of the pulp according to your requirements/ end use.</p><p>CONTACT US WITH YOUR TELEPHONE NUMBER AND EMAIL FOR DETAIL SPECIFICATIONS</p><h2>Specifications of Bleached Softwood Kraft Pulp (BSKP)</h2><p><a href=\"https://www.tradekey.com/product-free/Bleached-Hardwood-And-Softwood-Kraft-Pulp-bhkp-amp-Bskp--4237601.html\">Bleached Softwood Kraft Pulp</a> (BSKP)<br>1) Pulp</p><p>Dimensions Bale Unit Bale Unit<br>Length 82 cm 138 cm 82 cm 144 cm<br>Width 69 cm 82 cm 72 cm 82 cm<br>Height 45.5 cm 180 cm 43.5 cm 179 cm<br>Gross Weight 253 kg 2,024 kg 263 kg 2,107 kg<br>Packaging Individual packaging with pulp sheets, tagged green<br>Wires: Bales for Export: 2×1 rounds 2×1 rounds<br>Unit: 8 rounds 8 rounds<br>– Used for packaging and cardboard, specialty paper and printing and writing applications<br>– Provides good strength, structure and surface properties<br>– It is especially suitable for printing and writing papers and tissues<br>– For printing and writing end-uses, it provides good surface and optical properties<br>– For tissues, it provides softness and smoothness</p><p>We export Softwood Kraft Pulp to Europe, USA, Africa, middle east, Asia & Southeast Asia, South America, currently, we are looking forward to even greater cooperation with overseas customers based on mutual benefits. Being a leader in the industry, we are engaged in offering a qualitative range of Softwood Kraft Pulp.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Bleached-Softwood-Kraft-Pulp-002.jpg"
    ]
  },
  {
    "slug": "brown-kraft-paper-rolls-sheets",
    "title": "Brown Kraft Paper Rolls & Sheets",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Brown-Kraft-Paper-Rolls-00016.jpg",
    "cat": ["kraft-paper"],
    "tags": [
      "bleached-white-kraft-roll",
      "brown-kraft-paper-rolls-sheets",
      "kraft-paper",
      "kraft-paper-80gsm-jumbo",
      "kraft-paper-reels",
      "kraft-paper-rolls",
      "kraft-paper-sheets",
      "mg-white-brown-kraft-paper",
      "peach-paper",
      "pure-wood-pulp-kraft-paper",
      "reel-kraft-paper",
      "unbleached-brown-kraft",
      "virgin-kraft-paper"
    ],
    "excerpt": "<p>Kraft Paper</p><p>Kraft paper is paper or paperboard (cardboard) produced fromchemical pulps produced in the kraft papers.Pulp produced by thekraft process is stronger than that made by other pulpingprocesses; acidic degrade cellulose more, leading to weakerfibers, and mechanical pulping processes leave most of thelignin with the fibers, whereas kraft pulping removes most ofthe lignin present originally in the wood.</p>",
    "desc": "<p>Brown Kraft Paper Rolls & Sheets that are suitable for a wide range of applications. Brown Kraft paper has plenty of uses. It’s is great for covering books, boxes and other heavy products to protect against scratches. Crumple the Kraft paper and use it as an economic void fill. We can provide rolls or sheets according to your specification. Our Kraft paper is available in rolls that will fit standard dispensers.</p><p>We can according to your requirements to produce the brown Kraft paper, such as grammage, size, packing, quantity and diameter of roll…etc.</p><p>Available in Rolls, or in Sheets cut to your specifications.</p><p>Available Weights: 30gsm, 40gsm, 50gsm, 60gsm,70gsm 80gsm, 90gsm 120gsm, 200gsm, 225gsm, 280gsm</p><p>Weight per roll: 500kgs-1200kgs(as per your requirements)</p><p>Standard Roll Sizes: 12″, 18″, 24″, 30″, 36″, 48″, 60″, 72″</p><p>Standard Sheet Size: 1000mm*1100mm / 1200mm*1250mm</p><p>Color: Brown, natural white and bleached high white, black, gold and so on;</p><p>Application: For hand bag, envelope, file folder, book cover, gift box converting, sack, PE coating applications and packing as well as stationery purpose.Custom Roll and Sheets Sizes Available.</p><p>Products Features:<br>1.) High strength and Stiffness<br>2.) Strong folding resistance<br>3.) Light brown, dark brown or yellowish brown color shades<br>4.) Two side machine glazed smoothness and one side glazed smoothness<br>5.) Professional quality control system and exporting services</p><p>Basis Weight Roll Length Roll Diameter<br>30# 1200′ 8 1/2″<br>40# 900′ 8 1/2″<br>50# 720′ 8 1/2″<br>60# 600′ 8 1/2″<br>70# 510′ 8 1/2″<br>80# 450′ 8 1/2″<br>90# 400′ 8 1/2″<br>Virgin Kraft Paper</p><p>Available in Rolls or in Sheets cut to your specifications.</p><p>Available Weights: 30#, 40#, 50#, and 60# only.</p><p>Standard Roll Sizes – 12″, 18″, 24″, 30″, 36″, 48″, 60″, 72″</p><p>Custom Roll Sizes Available – 6″ through 72″</p><p>Basis Weight Roll Length Roll Diameter<br>30# 1380′ 8 1/2″<br>40# 1035′ 8 1/2″<br>50# 825′ 8 1/2″<br>60# 690′ 8 1/2″<br>Indented Kraft Paper</p><p>Available in Rolls or in Sheets cut to your specifications.</p><p>Available Weights: 60# and 84# only.</p><p>Standard Roll Sizes: 12″, 18″, 24″, 30″, 36″, 48″, 60″, 72″</p><p>Custom Roll Sizes Available – 6″ through 72″</p><p>Basis Weight Roll Length Roll Diameter<br>60# Sold by diameter 9″<br>84# Sold by diameter 9″<br>MG White Brown Kraft Paper<br>Kraft Paper sheets<br>Bleached White Kraft Paper Sheets 500mm x 600mm<br>White Bleached Kraft Roll 1m x 125m<br>Bleached White Kraft Paper Sheets 1000mm x 600mm 100 sheets<br>Brown Kraft <a href=\"https://schottpackaging.co.uk/product-category/protection/packing-paper/\" target=\"_blank\" rel=\"noopener\">Paper</a> Rolls</p><p>The product is made from selected quality virgin fiber and manufactured with latest state of art technology.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Brown-Kraft-Paper-Rolls-00016.jpg"
    ]
  },
  {
    "slug": "art-paper-boards",
    "title": "Art Paper Boards",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Art-Paper-Boards.jpg",
    "cat": ["art-paper-board"],
    "tags": ["art-paper-boards"],
    "excerpt": "<p>The color leather cover paper, also known as “cloud paper”, isgenerally used for documents, covers, and back covers oftenders, etc., which can effectively protect the bounds andextend shelf life of the documents. Art Paper Board. Two sidecoated&nbsp;<b>paper</b>&nbsp;available in Gloss and Mattvariety. These are used in manufacturing Brochures, Catalogs,Journals, Posters, Covers,&nbsp;<b>Art</b>&nbsp;and Coffee TableBooks to name a few.</p>",
    "desc": "<p>We are professional manufacture of matboard, passe-part, passepartout, paperboard, mount board ,mat boards, matt board,frame mats, photo mats,backing board, paper frame with strut and cardboard). These products can be used for matting photos, picture frame, wooden photo frame and digital frame, art and great for craft, signs, children’s projects and school’s projects. Art Paper Boards is an extruded polystyrene foam board bonded between two sheets of high-impact polystyrene or white card paper. Two side coated paper available in Gloss and Matt variety. These are used in manufacturing Brochures, Catalogs, Journals, Posters, Covers, Art and Coffee Table Books. Buy Art Paper Boards from us and get discount.</p><h2>Specification of <a href=\"https://en.wikipedia.org/wiki/Art_Papers\" target=\"_blank\" rel=\"noopener\">Art</a> Paper Boards</h2><p>1.Light-weight, Easily Transported and Processed;<br>2.Smooth and Easily Printed and Filmed with kinds of colors;<br>3.Good Plasticity,Excellent thermoforming material;<br>4.High Impact and Fireproof;<br>5.Anti-chemical Corrosion,Non-Toxic;<br>6. Moisture proof,Water-proof and Good Heat Preservation;<br>7.Good Sound Insulation and Shock Absorption;<br>8.Unfading and Anti-aging;</p><h2>Application of Art Paper:</h2><p>1) Solvent<br>2) Eco-solvent<br>3) UV printing<br>4) Screen printing<br>5) Computer lettering and engraving<br>6) Advertising labeling<br>7)Display boards<br>8)Sign boards<br>9)Photo album boards</p><p>We export Art Paper to Europe, USA, Africa, middle east, Asia & Southeast Asia, South America, currently, we are looking forward to even greater cooperation with overseas customers based on mutual benefits. You may also be interested in Writing & Printing Paper, Mondi Rotatrim Copy Paper, Paper One Copy paper A4 80Gsm, Chamex Copy Paper A4 80GSM, Chamex Copy Paper A4 80GSM, Xerox Multipurpose Copy Paper</p><p>Many people always wants to know how much Buy Art Paper Boards. To know more about us please click <a href=\"/\">here</a>.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Art-Paper-Boards.jpg"
    ]
  },
  {
    "slug": "chamex-copy-paper-a4-80gsm",
    "title": "Chamex Copy Paper A4 80GSM",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Chamex-Copy-Paper-A4-0003.jpg",
    "cat": ["copy-paper"],
    "tags": [
      "a4-paper",
      "chamex-copy-paper-a4-80gsm",
      "copier-a4-paper",
      "double-a4-paper"
    ],
    "excerpt": "<p><strong>Double A Global Paper Co.,Ltd</strong> is an Exporter ofall types of Premium Quality Paper Products. We offer A4 CopyPaper, Newsprint Paper, Kraft Paper, Tissue Paper, CarbonlessCopy Paper, NCR Paper, Carbon Paper, Color Papers, Paperboard,Bond Paper, Gloss coated Paper, Matt Coated Paper, RecycledPaper, Silk Coated Paper, Uncoated Paper, Watermarked Paper,Offset Paper, Printing Paper, Coated paper, Cardboard, Fine ArtPaper, Air Filter Paper, Fuel Filter Paper and Oil Filter Paper.</p>",
    "desc": "<p>Buy Chamex Copy Paper A4 80GSM at discount price. We are the largest Manufacturers of Papers in Thailand, such as Chamex Copy Paper A4 80GSM, <a href=\"/product/buy-paper-one-copy-paper-a4-80gsm/\">Paperone Print Paper</a>, <a href=\"/product/buy-double-a-a4-copy-paper-80-75-70-gsm/\">Double A A4 Paper</a>, Wrapping Machine, Paper Sheeter etc. We started&nbsp; as a small paper mill, now we run operations across Thailand right across the world with an annual combined pulp, paper, packaging product and converting capacity of over 19 million tons per annum. Today, We are suppliers of copier paper in world markets, our products are found in more than 120 countries across six continents Europe, North America, South America, Asia, Africa, Australia. Buy Chamex Copy Paper A4 80GSM and get discount of 10% with us.</p><h2>Specification of Chamex Copy Paper A4 80GSM:</h2><p>Chamex Copy Paper A4 75gsm, 80gsm, 90gsm.</p><p>Gramage: 80gsm, 75gsm, 70gsm<br>Quality: Imported 100% Natural Wood Pulp<br>Brightness = 102-104%,Natural White<br>Capability: High Speed Copying100ppm, Laser<br>Capable,Inkjet Capable, Fax Capable.<br>Thickness: 103-110 um<br>Surface roughness TS ml/min: 75-175<br>Surface roughness BS ml/min: 100-200<br>Bending stiffness MD: &gt;110 Mn<br>Bending stiffness CD: &gt;50 Mn<br>CIE whiteness: 148-152 or 152-165<br>Cobb Test: 27-33 g/m2 27-33<br>Two-sided usage gives the paper sheet high opacity.<br>Smooth paper surface makes sharp printing and copying.<br>Moist protected wrapper</p><p>Size:<br>International standard<br>A4: 210 x 297mm<br>A3: 420x 297mm<br>8.5 x 11-inch (216 x 279mm)<br>8.5 x 14-inch (216 x 330mm)</p><p>Key Performance:<br>No jam in photocopy machine<br>No double feed<br>Stay flat after copying<br>Leave no dust in the copy-machine<br>Nice appearance-white and clean<br>Nice touch-smooth and bulky<br>No see through-print both sides<br>Been developed for: Photocopy Machines, Laser Printers, Ink-jet Printers, Fax Machines</p><p>Features and Benefits:<br>Perfect for high-quality printing and copying<br>Super high whiteness produces outstanding clarity and contrast for all graphics and text<br>Precision-cut edges for trouble-free performance<br>User-friendly box design with built-in handle for easy carrying, tear slot perforation for easy access to the reams and label for filing</p><p>Outstanding Packaging<br>Standout/premium.<br>Special protective/moisture – proof wrapper.<br>Economic box</p><p>PACKAGING DETAILS<br>500 Sheets per Ream.<br>5 Reams per Box.<br>1560 Boxes per container(With Pallet).<br>1600 Boxes Per container( Without Pallet).<br>7800 Reams Total in one 20FCL( With Pallet).<br>8000 Reams Total in one 20FCL( Without Pallet).</p><p>FOR MORE INFO ON OUR PRODUCT, CONTACT US WITH YOUR FULL AND COMPLETE CONTACT INFO THROUGH OUR <a href=\"/contact-us/\">CONTACT</a> SO WE CAN SEND YOU ALL DETAILS FOR A BETTER COMMUNICATION AND BUILDING A LONG TERM BUSINESS RELATIONSHIP.</p><p>Get other A4 size copy paper here.</p><p>We also trade in all brands of&nbsp;copy papers&nbsp;such as Double A4 Copy paper Brand, Paper<a href=\"https://en.wikipedia.org/wiki/A4_size\" target=\"_blank\" rel=\"noopener\"> One copier</a> paper, Golden Star copier paper, Laser Copier Paper, Xerox multipurpose copy paper, Mondi Rotatrim Bond Paper, Typek copy Paper, IK PLUS Multipurpose copy paper, HP Multipurpose copy paper, IK Yellow A4 Paper, Reflex Copy Paper, Paperline Copier Paper, Copimax Paper and Chamex Brand Paper. We are professional manufacturers of all kinds of&nbsp;office paper, copy paper, offset paper, newspaper, printing papers with all brands available.</p><p>Our Mission at Double A is to export in bulks products like Chamex Copy Paper&nbsp;A4 80GSM, Blue Black Image Carbonless&nbsp;Copy Paper for Invoice, <a href=\"/product/soft-tissue-paper-toilet-roll/\">Soft Tissue Paper,</a> Bleached Softwood Kraft Pulp (BSKP), Brown Kraft Paper Rolls & Sheets (Pure Wood Pulp), JK A4 Copier Paper 75 GSM, Double A Copy Paper&nbsp;A4 (80/75/70 GSM), Double A Copy Paper A4 (80/75/70 GSM), Thermal Paper Rolls (Cash Register Paper), Original Navigator Copy Paper A4 70/75/80gsm, JK A4 Copier Paper 75 GSM, Art Paper Boards,&nbsp;IQ Brand A4&nbsp;Copy Paper – The Intellgent Choice and <a href=\"/product/newsprint-paper-rolls-sheets/\">Newsprint Paper</a> 45gsm, 42gsm, 48.8gms, 52gsm Rolls & Sheets.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Chamex-Copy-Paper-A4-0003.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Chamex-Copy-Paper-A4.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Chamex-Copy-Paper-A4-0001.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Chamex-Copy-Paper-A4-0002.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Chamex-Copy-Paper-A4-0003-1.jpg"
    ]
  },
  {
    "slug": "copimax-a4-printing-paper",
    "title": "Copimax A4 Printing Paper",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/COPIMAX-A4-Copy-Paper.jpg",
    "cat": ["copy-paper"],
    "tags": ["copimax-a4-copy-paper"],
    "excerpt": "<p><strong><span style=\"font-family: Times\">Quick Details</span></strong></p><p>Type: Copy Paper</p><p>Weight: 80G</p><p>Size: A4</p><p>Color: White</p><p>Brand Name: paper a4 500 folhas copimax</p><p>Model Number: 5345543</p><p>Place of Origin: Thailand</p>",
    "desc": "<p><a href=\"/product/copimax-a4-printing-paper/\">Buy Copimax A4 Printing Paper online</a>. <strong>Double A Global Paper Co.,Ltd</strong> is a manufacturer of Copy Paper Size A4, A5, A3 Copy paper 70, 75 & 80 GSM such as Copimax A4 Printing Paper. This brand is highly demanded by schools and offices presently. Inquire now to enjoy huge discounts. We supply from Thailand to many countries and have good services. We are trading of all kind of copier paper worldwide. Paper size A4 (210 X 297 mm.) Weight: 70 and 80 gsm available! High-quality <a href=\"https://www.globalsources.com/si/AS/PT-Era/6008847932202/pdtl/Copimax-Copy-Paper-A4-80gsm/1136961674.htm\" target=\"_blank\" rel=\"noopener\">paper</a> renown for its excellent performance and environmentally friendly attributes is suitable for photocopies, printing with inkjet and laser printers and offset preprints. A Color Paper 80 gsm. A4 (210 X 297 mm.) Paper, Premium quality for your printing and copying.</p><h2>Specification of Copimax A4 Printing Paper.</h2><p>Gramage: 80gsm, 75gsm, 70gsm<br>Quality: Imported 100% Natural Wood Pulp<br>Brightness = 102-104%, Natural White<br>Capability: High Speed Copying100ppm, Laser<br>Capable, Inkjet Capable, Fax Capable.<br>Thickness: 103-110 um<br>Surface roughness TS ml/min: 75-175<br>Surface roughness BS ml/min: 100-200<br>Bending stiffness MD: &gt;110 Mn<br>Bending stiffness CD: &gt;50 Mn<br>CIE whiteness: 148-152 or 152-165<br>Cobb Test: 27-33 g/m2 27-33<br>Two-sided usage gives the paper sheet high opacity.<br>Smooth paper surface makes sharp printing and copying.<br>Moist protected wrapper</p><h2>Key Performance of Copimax A4 80gsm</h2><p>No jam in photocopy machine<br>No double feed<br>Stay flat after copying<br>Leave no dust in the copy-machine<br>Nice appearance-white and clean<br>Nice touch-smooth and bulky<br>No see through-print both sides<br>Been developed for: Photocopy Machines, Laser Printers, Ink-jet Printers, Fax Machines</p><p data-spm-anchor-id=\"a2700.details.0.i21.695ccd74dBJ7Qt\">Features and Benefits:</p><p data-spm-anchor-id=\"a2700.details.0.i21.695ccd74dBJ7Qt\">Perfect for high-quality printing and copying<br>Super high whiteness produces outstanding clarity and contrast for all graphics and text<br>Precision-cut edges for trouble-free performance<br>User-friendly box design with built-in handle for easy carrying, tear slot perforation for easy access to the reams and label for filing. Buy Copimax A4 Printing Paper at cheap rate with us. <a href=\"/\">buy printing paper Romania</a></p><p>Apart from Copimax A4 Printing Paper get other products <a href=\"/products/\">here.</a></p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/COPIMAX-A4-Copy-Paper.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/COPIMAX-A4-Copy-Paper-0004-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/COPIMAX-A4-Copy-Paper-0001-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/COPIMAX-A4-Copy-Paper-0002-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/COPIMAX-A4-Copy-Paper-0003-1.jpg"
    ]
  },
  {
    "slug": "copy-laser-paper-80gsm",
    "title": "Copy Laser Paper 80GSM",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Copy-Laser-Paper-A4-80GSM.png",
    "cat": ["copy-paper"],
    "tags": ["copy-laser-paper-a4-80gsm"],
    "excerpt": "<p>Photocopy A4 80GSM, 75GSM, 70GSM For Sale. Premium Quality.</p>",
    "desc": "<p>Buy Copy Laser Paper 80GSM. We manufactures and exports Copy Laser Paper 80GSM / 75GSM / 70GSM. Premium Quality Copy Paper, Good Will, Perfect Services and Fast Delivery of Office paper products. <a href=\"/product/buy-copy-laser-paper-80gsm/\">Buy A4 Copy Double A Europe</a></p><p>Details:</p><p><a href=\"https://www.amazon.eg/-/en/Copy-Laser-Printing-Imaging-Paper/dp/B09B93MP5V\">Copy Laser Paper A4 80GSM.</a></p><p><u>Size</u><br>International standard<br>A4: 210 x 297mm<br>A3: 420 x 297mm<br>8.5 x 11-inch (216 x 279mm)<br>8.5 x 14-inch (216 x 330mm)</p><p><u>Outstanding Packaging</u></p><p>– 500 Sheets per Ream 5 Reams per Box<br>– 1560 Boxes per 20ft container (With Pallet)<br>– 1600 Boxes Per 20ft container (Without Pallet)<br>– 7800 Reams Total in one 20FCL (With Pallet)<br>– 8000 Reams Total in one 20FCL (Without Pallet)</p><h2>Key performance of Copy Laser Paper 80GSM</h2><p>No jam in photocopy machine<br>No double feed<br>Stay flat after copying<br>Leave no dust in the copy-machine<br>Nice appearance-white and clean<br>Nice touch-smooth and bulky<br>No see through-print both sides<br>Been developed for: Photocopy Machines, <a href=\"https://en.wikipedia.org/wiki/Laser_copy_paper\" target=\"_blank\" rel=\"noopener\">Laser</a> Printers, Ink-jet Printers, Fax Machines</p><p>Seven advantages:</p><p>1. Good feeding effect: Precise control on moisture during production<br>guarantees the flattening of paper in copying and reduces jamming.<br>2. Distinct copying: Smooth surface makes for copying of original colors.<br>The copy looks like originals.<br>3. Being white and bright: with high-quality material and advanced techniques, the paper is high in whiteness and brightness and improves distinctness in copying.<br>4. Longer working life of copy machines: neat cutting reduces the dust in paper. Smooth surface reduces the machines from wearing and maintaining.<br>5. Double-copying, and economic: high-quality material makes the paper with good opacity. Double-copying still has good effect.<br>6. Excellent moisture-resistant, abrasion resistant and folding endurance.<br>7.Strong strength and elongation, soft, non-toxic.</p><p>Contact us for more details <a href=\"/contact-us/\">here</a>. <a href=\"/product/buy-copy-laser-paper-80gsm/\">Buy Copy Laser Paper 80GSM</a> with great quality at affordable prices.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Copy-Laser-Paper-A4-80GSM.png",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Copy-Laser-Paper-A4-80GSM-0002-600x451-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Copy-Laser-Paper-A4-80GSM-0001.jpg"
    ]
  },
  {
    "slug": "double-a-a4-copy-paper-80-75-70-gsm",
    "title": "Double A4 Copy Paper (80/75/70 GSM)",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Double-A-Copy-Paper-A4-0001.jpg",
    "cat": ["copy-paper"],
    "tags": ["double-a4-copy-paper"],
    "excerpt": "<p>Double A Copy Paper A4 a paper has a smooth finish and addedbulk for clear printing and combined with exceptional opacity,delivers quality double sided printing and copying.</p>",
    "desc": "<p>Our Mission at <a href=\"/\">Double A Global Paper Co.,Ltd&nbsp;</a>is to offer products like&nbsp;Chamex Copy Paper&nbsp;A4 80GSM, Blue Black Image <a href=\"/product/carbonless-ncr-copy-paper-for-invoice/\">Carbonless Copy Paper</a> for Invoice, Bleached Softwood <a href=\"/product/brown-kraft-paper-rolls-sheets/\">Kraft</a> Pulp (BSKP), Copy /&nbsp;Laser Paper&nbsp;A4 80GSM, Double A Copy Paper A4 (80/75/70 GSM), Double A Copy Paper A4 (80/75/70 GSM), Thermal Paper Rolls (Cash Register Paper), Original <a href=\"/product/buy-original-navigator-a4-copy-paper-80gsm/\">Navigator Copy Paper A4 70/75/80gsm</a>,&nbsp;JK A4 Copier Paper&nbsp;75 GSM,&nbsp;IQ Brand A4&nbsp;Copy Paper – The Intellgent Choice, <a href=\"/product/buy-paperline-gold-a4-copy-paper/\">Paperline</a> Gold A4 Copy Paper and Colored Paper. Buy Double A A4 Copy Paper (80/75/70 GSM). It has a smooth finish and added bulk for clear printing and combined with exceptional opacity, delivers quality double sided printing and copying. <a href=\"/product/buy-double-a-a4-copy-paper-80-75-70-gsm/\">Buy Double A 70gsm 75gsm 80gsm</a></p><h2>Specification of Double A Copy Paper</h2><p>–<a href=\"https://ssgrouplimited.com/\" target=\"_blank\" rel=\"noopener\">Double A</a> Copy Paper A4 (80/75/70 GSM)</p><p>1.&nbsp;Products:&nbsp;A4, A3 Copy/Print Paper, <a href=\"/product/newsprint-paper-rolls-sheets/\">News Print Paper,</a> <a href=\"/product/carbonless-ncr-copy-paper-for-invoice/\">Carbon Paper</a>, Waste Paper, <a href=\"/product/thermal-paper-rolls-cash-register/\">Soft Tissue Paper</a>, Gift Wrapping Paper, OCC Paper, <a href=\"/product/thermal-paper-rolls-cash-register/\">Thermal Paper</a>, <a href=\"/product/buy-art-paper-boards/\">Art Board Paper</a>, <a href=\"/product/duplex-board-paper/\">Duplex Board Paper</a>, <a href=\"/product/colored-printing-paper/\">Color Printing paper,</a> <a href=\"/product/brown-kraft-paper-rolls-sheets/\">Kraft Paper</a>,&nbsp;and Computer Printing & Continuous Paper</p><p>2.&nbsp;Size:&nbsp;A4, A3, Letter size(8.5X11), Legal size(8.5X13,8.5X14)<br>3.&nbsp;Weight:&nbsp;65gsm/70gsm/75gsm/80gsm/95g/100g/110g/120g/150g/160g/180/210g/230g/250g<br>4. Certification: Certificate/ISO9001:2/SGS/MSDS Quality: Imported 100% Natural Wood Pulp<br>Brightness: 102-104%, 98-100%,108-110%<br>Capability: High Speed Copying 100ppm, Laser<br>Capable, Inkjet Capable, Fax Capable.<br>Thickness: 103-110 um<br>Surface roughness TS ml/min: 75-175<br>Surface roughness BS ml/min: 100-200<br>Bending stiffness MD: &gt;110 Mn<br>Bending stiffness CD: &gt;50 Mn<br>CIE whiteness: 148-152 or 152-165<br>Cobb Test: 27-33 g/m2 27-33<br>Material 100% Virgin Wood pulp<br>Size: A5, A4, A3, A2, A1, A0, Letter size (8.5X11), Legal size (8.5X13, 8.5X14) – International standards<br>A4: 210 x 297mm<br>A3: 420x 297mm<br>8.5 x 11-inch (216 x 279mm)<br>8.5 x 14-inch (216 x 330mm)</p><h2>Features and Benefits of Double A A4 Copy Paper (80/75/70 GSM):</h2><p>Perfect for high-quality printing and copying<br>Super high whiteness produces outstanding clarity and contrast for all graphics and text<br>Precision-cut edges for trouble-free performance<br>User-friendly box design with built-in handle for easy carrying, tear slot perforation for easy access to the reams and label for filing<br>Outstanding Packaging<br>Stand-out & Premium Products<br>Economic boxes<br>Two-sided usage gives the paper sheet high opacity.<br>Smooth paper surface makes sharp printing and copying.<br>Protective & Moist protected wrapper<br>Nice touch-smooth and bulky<br>No see trough-print both sides<br>Guaranteed for trouble-free operation<br>No see through-print both sides<br>Been developed for: Photocopy Machines, Laser Printers, Ink-jet Printers, Fax Machines<br>Multipurpose Papers</p><p data-spm-anchor-id=\"a2700.details.0.i18.4199501cqwNaE0\">We run operations from Thailand across the world with an annual combined pulp, paper, packaging product and converting capacity of over 15 million tons per annum.&nbsp; Double A Global Paper Co.,Ltd is a Manufactures and suppliers of copier paper in world markets, our products are found in more than 120 countries across six continents Europe, North America, South America, Asia, Africa, and Australia. We offer other brands <a href=\"/products/\">here</a>. Buy Double A A4 Copy Paper (80/75/70 GSM) now and get discount. <a href=\"/product/buy-double-a-a4-copy-paper-80-75-70-gsm/\">Buy Double A wholesale Thailand</a></p><p data-spm-anchor-id=\"a2700.details.0.i18.4199501cqwNaE0\">Our goal at <a href=\"/\">Double A Global Paper CO.,LTD</a> is to offer products like <a href=\"/product/buy-chamex-copy-paper-a4-80gsm/\">Chamex Copy Paper A4 80GSM</a>, Copy / Laser Paper&nbsp;A4 80GSM, Bleached Softwood Kraft Pulp (BSKP), Brown Kraft Paper Rolls & Sheets (Pure Wood Pulp), JK A4 Copier Paper 75 GSM,&nbsp;Double A Copy Paper&nbsp;A4 (80/75/70 GSM), <a href=\"/product/buy-double-a-a4-copy-paper-80-75-70-gsm/\">Double A Copy Paper</a> A4 (80/75/70 GSM),&nbsp;Thermal Paper Rolls&nbsp;(Cash Register Paper), <a href=\"/product/buy-original-navigator-a4-copy-paper-80gsm/\">Original Navigator Copy Paper A4</a> 70/75/80gsm,&nbsp;JK A4 Copier Paper&nbsp;75 GSM, Art Paper Boards, Paper One Copy paper A4 80Gsm and Newsprint Paper 45gsm, 42gsm, 48.8gms, 52gsm Rolls & Sheets.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Double-A-Copy-Paper-A4-0001.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Double-A-Copy-Paper-A4-0002-600x450-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Double-A-Copy-Paper-A4-0003-600x450-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Double-A-Copy-Paper-A4-0004-600x399-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Double-A-Copy-Paper-A4-0005-600x450-1.jpg"
    ]
  },
  {
    "slug": "ik-plus-a4-copy-paper-80gsm",
    "title": "IK Plus A4 Copy Paper 80GSM",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/IK-Plus-Multi-Purpose-Copy-Paper-A4-80GSM.jpg",
    "cat": ["copy-paper"],
    "tags": ["ik-plus-multi-purpose-copy-paper-a4-80gsm-75gsm-70gsm"],
    "excerpt": "<p>IK Plus Multi Purpose Copy Paper A4 80GSM/75GSM/70GSM For Sale.Buy Premium Quality Copy Paper, Perfect Services and FastDelivery of Office paper products.</p>",
    "desc": "<p>Buy IK Plus A4 Copy Paper 80GSM. KJ& B Public Company Limited is a professional factory who is devoted to office & school stationery supplies. We have built an excellent purchasing network in Thailand successfully for the brand Double A and IK Plus A4 Copy Paper 80GSM A4 /75GSM/70GSM. With the expansion of our company, our business scope has also expanded. With the advantage of grand scale, complete system : R&D, produce, sale, shipment, after-sales service and advanced produce method, our factory is favored by clients both at home and abroad. We can supply one-stop purchasing of various kind of office and school stationery supplies both in stock and customized, such as:</p><p><strong>Paper material stationery products:</strong></p><p>A4 copy paper,PC print NCR paper, lndex paper,Sketch paper,Cash register paper,Thermal paper,Post-it note and various kind of notebooks.</p><p><a href=\"/\">Buy IK Plus A4 paper in Middle East</a></p><p>SPECIFICATION</p><h2><a href=\"https://www.globalsources.com/si/AS/cv-sarana/6008852268682/pdtl/IK-Plus-Multi-Purpose-Copy-Paper-A4-80gsm/1149766449.htm\">IK Plus A4 Multi Paper 80GSM.</a></h2><p>– Sheet Size: 210mm x 297mm/297mm x 420mm<br>International Paper Standards Size(ISO) A4/A3<br>– Quality: Imported 100% Virgin Wood Pulp<br>– Whiteness: 102-104%,Natural White<br>– Grading: A<br>– Thickness: 106cm<br>– Capability: High Speed Copying 100ppm,<br>Laser Capable,Inkjet Capable, Fax Capable.</p><h2>Key Performance of IK Plus Printing Paper 70GSM</h2><p>– No jam in Photocopy machines<br>– No double feed<br>– Stay flat after copying (even in laser)<br>– Leave no dust in the copy machine<br>– White and clean, Smooth and bulky<br>– No see through printing in both side<br>– Best result in Photocopy machines<br>– Laser printers, Inkjet printer, Fax, etc.</p><p>Paper size A4 (210 X 297 mm.) Whiteness: A grade (102-104%) Weight: 70 gsm, 75 gsm, 80 gsm available!<br>Paper from Farmed Trees<br>Double-A High-quality paper renown for its excellent performance and environmental friendly attributes is suitable for<br>photocopies, printing with inkjet and laser printers and offset preprints.<br>Double-A Colour Paper 80 gsm. A4 (210 X 297 mm.) Paper, Premium quality for your printing and copying. <a href=\"/\">buy printing paper online</a></p><p>Product details<br>A3 (297×420 mm.) 500 sheets<br>A4 (210×297 mm.) 40 sheets, 100 sheets, and 500 sheets<br>B4 (257 X 364 mm.) 100 sheets<br>F14 (216 X 356 mm.) 40 sheets, 100 sheets, and 500 sheets</p><p>Our main paper as below:<br>Whiteness: A grade (102-104%)<br>B grade (98-100% )<br>C grade (94-96% )<br>Weight: 70 gram; 75 gram; 80 gram</p><p>PACKAGING DETAILS<br>– 500 SHEETS PER REAM<br>– 5 REAMS PER BOX.<br>– 1560 BOXES PER 20FT CONTAINER (WITH PALLET)<br>– 1600 BOXES PER 20FT CONTAINER (WITHOUT PALLET).<br>– 7800 REAMS TOTAL IN ONE 20FCL (WITH PALLET).<br>– 8000 REAMS TOTAL IN ONE 20FCL (WITHOUT PALLET).</p><p>More info about our company and products we produced <a href=\"/about-us/\">here</a>. Buy IK Plus A4 Copy Paper 80GSM, 75GSM & 70GSM at factory rate.<a href=\"/\"> Buy IK Plus A4 paper in UAE</a></p><h2></h2>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/IK-Plus-Multi-Purpose-Copy-Paper-A4-80GSM.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/IK-Plus-Multi-Purpose-Copy-Paper-A4-80GSM-0004-600x450-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/IK-Plus-Multi-Purpose-Copy-Paper-A4-80GSM-0003-600x784-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/IK-Plus-Multi-Purpose-Copy-Paper-A4-80GSM-0002-600x600-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/IK-Plus-Multi-Purpose-Copy-Paper-A4-80GSM-0001.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/IK-Plus-Multi-Purpose-Copy-Paper-A4-80GSM-0005.jpg"
    ]
  },
  {
    "slug": "iq-brand-a4-copy-paper-80gsm",
    "title": "IQ Brand A4 Copy Paper 80GSM",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/IQ-Brand-A4-Copy-Paper.jpg",
    "cat": ["copy-paper"],
    "tags": [
      "a4-photocopy-paper-iq-allround",
      "copy-paper-iq-allround",
      "copy-paper-iq-economy",
      "copy-paper-iq-premium",
      "iq-brand-a4-copy-paper",
      "iq-brand-copy-laser-paper-70-gsm-92",
      "iq-brand-copy-laser-paper-70-gsm-new-blue",
      "iq-brand-copy-laser-paper-80-gsm-92",
      "iq-brand-copy-laser-paper-80-gsm-95",
      "iq-copy-paper",
      "mondi-iq-premium-a4-copy-paper",
      "photocopy-paper-iq-allround-brand"
    ],
    "excerpt": "<p>IQ BRAND – The Intelligent Choice<br>Type : 80 GSM / PINK COLOR<br>2-side copy paper.<br>Wrap with sleek package for resisting of humidity.<br>Suitable for copying and printing work.</p>",
    "desc": "<p>Buy IQ Brand A4 Copy Paper 80GSM. Moisture Control, White and clean, Smooth and Super Bulky, No see through Printing in both side, Leave no dust in the copy machine, Double Sided Copying of the best Quality, 100% Virgin wood Pulp. IQ Brand A4 Copy Paper – The Intelligent Choice is best for office purposes.</p><p>Description :</p><p>IQ Brand A4 Copy Paper – The Intelligent Choice.</p><p>Smooth paper with pink case.<br>2-side copy paper.<br>Reduce crooked paper problem.<br>Wrap with sleek package for resisting of humidity.<br>Suitable for copying and printing work.<br>Features :</p><p>Thickness : 80 gsm.<br>Size : A4, A3, A5, F14, B4, B5<br>500 sheets. / Ream<br>5 Reams / box<br>Types: Copy & Laser paper<br>80 GSM / IQ PINK COLOR<br>IQ Brand Copy & Laser Paper 70 gsm (92%)<br>IQ Brand Copy & Laser Paper 80 gsm (95%)<br>Copy Paper IQ PREMIUM<br>Photocopy Paper IQ Allround Brand<br>Copy Paper IQ ALLROUND<br>IQ Brand Copy & Laser Paper 80 gsm (92%)<br>Copy Paper IQ Economy<br>A4 Photocopy<a href=\"https://en.wikipedia.org/wiki/Carbonless_copy_paper\" target=\"_blank\" rel=\"noopener\"> Paper</a> IQ Allround<br>IQ Copy paper<br>IQ Brand Copy & Laser Paper 70 gsm (new blue)</p><p>Copy Paper IQ ALL ROUND</p><p>Key Performance:<br>No jam in photocopy machine<br>No double feed<br>Stay flat after copying<br>Leave no dust in the copy-machine<br>Nice appearance-white and clean<br>Nice touch-smooth and bulky<br>No see through-print both sides<br>Been developed for : Photocopy Machines, Laser Printers, Ink-jet Printers, Fax Machines</p><p>PACKING DETAILS:</p><p>500 Sheets per Ream<br>5 Reams per Box.<br>1560 Boxes per container(With Pallets).<br>1600 Boxes Per container( Without Pallets).<br>7800 Reams Total in one 20FCL( With Pallets).<br>8000 Reams Total in one 20FCL( Without Pallets).</p><p>Buy IQ Brand A4 Copy Paper 80GSM at discount rate. You can also check some of the papers we manufactures <a href=\"/products/\">here.</a></p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/IQ-Brand-A4-Copy-Paper.jpg"
    ]
  },
  {
    "slug": "jk-a4-copier-paper-70-gsm",
    "title": "JK A4 Copier Paper 70 GSM",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/JK-A4-Copier-Paper-75-GSM-0003.jpg",
    "cat": ["copy-paper"],
    "tags": ["jk-a4-copier-paper-75-gsm"],
    "excerpt": "<p>KEY FEATURES</p><p>Ideal for quality photocopying.<br>ColorLok technology – Faster drying, bolder blacks, vividcolors.<br>Paper Finish: Smooth.<br>Corner/Edge Style: Square.</p>",
    "desc": "<p>Buy JK A4 Copier Paper 70 GSM from Double A Global Paper Co.,Ltd with discount. It’s a premium multipurpose office paper with HP Color-look technology for bolder black sharper text and vibrant image with brilliant color. Manufactured with latest twin wire technology. Wood from plantation and elemental chlorine free pulp. Super white paper with excellent optical properties no fade out or reversion in addition to high strength with excellent surface properties. Long lasting and Compatible with all types of photocopying systems and hassle free dual side copying. Preferred by most offices and corporate for commercial usage.</p><p>JK COPIER PAPER,A-4 Size : 75 GSM. 500 Sheets / ream. Copier Paper for Quality Copying & Printing,Compatible with all types of photocopying systems, Suitable for both side printing</p><h2>Product Specification (JK A4 Paper)</h2><p>Compatible with all types of photocopying systems</p><p>Suitable for both side printing</p><p>Trouble free Performance in any type of printing machine</p><p>Superior photo imaging</p><p>Crisp image formation</p><p>Ideal for Quality Photocopying, Assignments</p><p>Suitable for any job</p><p>SPECIFICATIONS</p><p>Brand Jk<br>Sheet Size (LxB)<br>21×29.7 cm</p><p>Number of Sheets<br>500 Sheets</p><p>Paper Size<br>A4</p><p>Paper Density<br>75 GSM</p><p>Suitable For<br>Copying and Printing</p><p>Items in Pack<br>10 Reams</p><p>Color<br>White</p><p>Size: 1 Ream / 500 sheets<br>JK A4 Copier Paper 75 GSM is a <a href=\"https://www.doubleaglobalpaper.com/product/onp/#\" target=\"_blank\" rel=\"noopener\">stationery</a> needs which pops up in the head for photocopying sheets. These sheets are also compatible with all kinds of photocopying system. The sheets come with latest Color-look technology. Faster drying, bolder black, vivid colors are the major feature of this sheets.</p><p>PACKING DETAILS:</p><p>500 Sheets per Ream<br>5 Reams per Box.<br>1560 Boxes per container(With Pallets).<br>1600 Boxes Per container( Without Pallets).<br>7800 Reams Total in one 20FCL( With Pallets).<br>8000 Reams Total in one 20FCL( Without Pallets).</p><p>Buy JK A4 Copier Paper 70 GSM /75 GSM / 80 GSM <a href=\"/products/\">here</a> at cheap rate.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/JK-A4-Copier-Paper-75-GSM-0003.jpg"
    ]
  },
  {
    "slug": "mondi-rotatrim-copy-paper",
    "title": "Mondi Rotatrim Copy Paper",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Mondi-Rotatrim-Copy-Paper.jpg",
    "cat": ["copy-paper"],
    "tags": ["mondi-rotatrim-copy-paper"],
    "excerpt": "<p>Outstanding Packaging<br>Standout / premium.<br>Special protective / moisture – proof wrapper.<br>Economic box.</p>",
    "desc": "<p>Buy Mondi Rotatrim Copy Paper 80/75/70 GSM at Wholesale. High quality Mondi Rotatrim Copy Paper known for its excellent performance and High smoothness attributes.</p><p>Specifications</p><p>Size 210mm X 297mm/297mm X 420mm International Paper Standards Size(Iso) A4/A3<br>Brand Name Mondi <a href=\"https://www.doubleaglobalpaper.com/product/dsocc/\" target=\"_blank\" rel=\"noopener\">Rotatrim</a><br>Quality Imported 100% Virgin Wood Pulp<br>Whiteness 102-104%,Natural White<br>Brightness 102-104% Above<br>Grading A<br>Thickness 106cm<br>Capability High Speed Copying 100ppm, Laser Capable, Inkjet Capable, Fax Capable.<br>Moisture Control Makes The Sheets Stay Flat In The Copier And Enhances Run-ability<br>Low Dust Content Minimizing Your Copier Running Cost.<br>Good Opacity Double Sided Copying Of The Best Quality<br>Smoothness Improving Printing Quality<br>Bulky Sheet Enhancing Smooth Run-ability<br>Salient Features:<br>– Eco-friendly paper<br>– Precision cut edges for trouble free performance<br>– Dual side printability<br>– Elemental chlorine free<br>– No dust copy paper<br>– High smoothness<br>– Consistent performance<br>– GSM: 70/75/80/85<br>– Size: A4 (210x297mm) / FS<br>– Available in 75GSM (color copier)<br>– Pallet packing also available</p><p>Best For Use with your<br>Photocopier<br>Laser Printer<br>Fax Machine<br>Ink-jet<br>Copier<br>2 side copying.</p><p>Outstanding Packaging.<br>Standout / premium.<br>Special protective / moisture – proof wrapper.<br>Economic box.</p><p>PACKING DETAILS:</p><p>500 Sheets per Ream<br>5 Reams per Box.<br>1560 Boxes per container(With Pallets).<br>1600 Boxes Per container( Without Pallets).<br>7800 Reams Total in one 20FCL( With Pallets).<br>8000 Reams Total in one 20FCL( Without Pallets).</p><p>Buy Mondi Rotatrim Copy Paper at affordable prices. All brands of papers <a href=\"/products/\">here.</a></p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Mondi-Rotatrim-Copy-Paper.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Mondi-Rotatrim-Copy-Paper-2.jpg"
    ]
  },
  {
    "slug": "multioffice-a4-size-copy-paper-80gsm",
    "title": "MultiOffice A4 Size Copy Paper 80gsm",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/MultiOffice-A4-Copy-Paper.jpg",
    "cat": ["copy-paper"],
    "tags": [
      "a4-paper",
      "copier-a4-paper",
      "double-a4-paper",
      "multioffice-a4-size-copy-paper-80gsm"
    ],
    "excerpt": "<p>Multi Office A4 Size Copy Paper 80 gm. – Box of 5 Reams</p><p>QUALITY – Perfect whiteness, high opacity and stiffness, highoptimal aesthetics in its segment and very good runnability.</p>",
    "desc": "<p>Buy MultiOffice <a href=\"https://en.wikipedia.org/wiki/Paper_size\" target=\"_blank\" rel=\"noopener\">A4</a> Size Copy Paper 80gsm. MultiOffice is the ideal paper for users looking for a very reliable, trouble-free and cost-efficient product for everyday copying and printing jobs, in color or black and white.&nbsp;&nbsp;Excellent productivity in document mass-production and the highest and most consistent quality in the office paper market.&nbsp;&nbsp;Perfect CIE whiteness of 161,&nbsp;high opacity and stiffness, high optimal aesthetics in its segment and very good run-ability.</p><p>RELIABILITY – The ideal paper for users looking for a very reliable, trouble-free and cost-efficient product for everyday copying and printing jobs, in color or black and white.</p><p>CONSISTENCY – Excellent productivity in document mass-production and the highest and most consistent quality in the office paper market.</p><p>QUALITY – Perfect whiteness, high opacity and stiffness, high optimal aesthetics in its segment and very good run-ability.</p><p>Description</p><p>High quality paper for everyday work in the office and at home.<br>It is an ultra-white paper, you can print the information you need perfectly, the text is crisp, and the paper is perfectly absorbed in all colors.<br>Eucalyptus wood fiber is used in production.<br>Suitable for all color and color printers and copiers.<br>FSC, ECF, EU ECOLABEL. ISO 9706, ISO 9001, ISO 14001.<br>Weight: 80 g/m2.<br>A4 format.<br>Packaging: 500 sheets.<br>In a box: 5 pcs.</p><h2>Packaging & Delivery of MultiOffice A4 Size Copy Paper 80gsm.</h2><p>Packaging Details: 500 sheets per ream.<br>5 reams per box.<br>42 boxes per palette.<br>Abt. 1600 boxes per 20″ container.<br>1932 boxes ( 46 plts.) per 40″ container.<br>Delivery Detail: 2 working days.<br>Specifications</p><p>A4 Photocopy Paper 80 gsm.<br>Copier Paper.</p><p>MultiOffice, the stress free paper.</p><p>For the best results in your daily document applications. MultiOffice with its whiteness, will allow you to obtain better printing definition, even when color is used.</p><p>With its high performance and reliability, MultiOffice is the right choice to have a stress free office.</p><p>Buy MultiOffice A4 Size Copy Paper 80gsm with discount rates. Contact us for more details <a href=\"/contact-us/\">here</a>.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/MultiOffice-A4-Copy-Paper.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/MultiOffice-A4-Copy-Paper-001.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/MultiOffice-A4-Copy-Paper-003.jpg"
    ]
  },
  {
    "slug": "original-navigator-a4-copy-paper-80gsm",
    "title": "Original Navigator A4 Copy Paper 80GSM",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Original-Navigator-Copy-Paper-A4-0004.jpg",
    "cat": ["copy-paper"],
    "tags": [
      "a4-paper",
      "copier-a4-paper",
      "double-a4-paper",
      "original-navigator-copy-paper-a4-70-75-80gsm"
    ],
    "excerpt": "<p>Buy Original Navigator Copy Paper A4 70/75/80gsm at Wholesaleprices. Bulk offer. Contact Now. Original. High Quality.</p><p>A4, A3<br>Letter size<br>Legal size<br>80gsm<br>8000 reams<br>4000 reams<br>8000 reams<br>6300 reams<br>75gsm<br>8200 reams<br>4100 reams<br>8500 reams<br>6500 reams<br>70gsm<br>8400 reams<br>4200 reams<br>8800 reams<br>6700 reams.</p>",
    "desc": "<p>Buy Original Navigator A4 Copy Paper 80GSM 75GSM & 75GSM. We are manufacturing and supplying company from Thailand to many countries and have good services. We have enough quantity of A4 paper to sale.</p><p>Specification:</p><p>Original <a href=\"https://en.wikipedia.org/wiki/The_Navigator_Company\" target=\"_blank\" rel=\"noopener\">Navigator</a> Copy Paper A4</p><p>– Sheet Size:210mm x 297mm/297mm x 420mm International Paper Standards Size(ISO) A4/A3<br>– Quality: Imported 100% Virgin Wood Pulp<br>– Whiteness: 102-104%,Natural White<br>– Grading: A<br>– Thickness: 106cm<br>– Capability: High Speed Copying 100ppm, Laser Capable,Inkjet Capable, Fax Capable.</p><p>EXCELLENT PERFORMANCE DUE TO THE FOLLOWING CHARACTERISTICS</p><p>– Moisture Control – Makes the sheets stay flat in the copier and enhances run-ability.<br>– Low Dust Content – Minimizing Your copier ruNning cost.<br>– Good Opacity – Double sided copying of the best quality<br>– Smoothness – Improving Printing Quality.<br>– Bulky Sheet – Enhancing smooth run-ability</p><p>Best For Use with your</p><p>– Photocopier<br>– Laser Printer<br>– Fax Machine<br>– Ink-jet<br>– Copier<br>– 2 side copying</p><p>PACKING DETAILS:</p><p>500 Sheets per Ream<br>5 Reams per Box.<br>1560 Boxes per container(With Pallets).<br>1600 Boxes Per container( Without Pallets).<br>7800 Reams Total in one 20FCL( With Pallets).<br>8000 Reams Total in one 20FCL( Without Pallets).</p><p>We also trade in all brands of copy papers such as <a href=\"/product/buy-double-a-a4-copy-paper-80-75-70-gsm/\">Double A4 Copy paper Brand</a>, Paper One copier paper, Golden Star copier paper, Laser Copier Paper, Xerox multipurpose copy paper, Mondi Rotatrim Bond Paper, Typek copy Paper, <a href=\"/product/ik-plus-a4-copy-paper-80gsm/\">IK PLUS</a> Multipurpose copy paper, HP Multipurpose copy paper, IK Yellow A4 Paper, Reflex Copy Paper, Paperline Copier Paper, Copimax Paper and Chamex Brand Paper. We are professional manufacturers of all kinds of office paper, copy paper, offset paper, newspaper, printing papers with all brands available.</p><p>Buy Original Navigator A4 Copy Paper 80GSM at factory price. How to order here.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Original-Navigator-Copy-Paper-A4-0004.jpg"
    ]
  },
  {
    "slug": "paper-one-copy-paper-a4-80gsm",
    "title": "Paper One Copy paper A4 80Gsm",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Paper-One-Copy-paper-0006.jpg",
    "cat": ["copy-paper"],
    "tags": ["paper-one-copy-paper-a4-80gsm"],
    "excerpt": "<p>PaperOne features both multi-directional and dual-sidedprintability, is a range of premium quality home and officepaper.</p>",
    "desc": "<p><a href=\"/\">Buy Paper One Copy paper A4 80Gsm</a>.</p><p>Our Paper Brands:</p><p>A4&nbsp;copier paper</p><p>Chamex</p><p>Paperone copier paper</p><p>Golden Star copier paper</p><p>Laser / Copier Paper</p><p>Multipurpose copy paper</p><p>HP Multipurpose copy paper</p><p>Golden Star copier paper</p><p>Laser / Copier Paper</p><p>Mondi Rotritrim copy Paper</p><p>IK Plus&nbsp;A4&nbsp;Paper</p><p>IK Yellow&nbsp;A4&nbsp;Paper</p><p>Product Details:</p><p>ITEM:&nbsp;A4&nbsp;COPY PAPER 80 GSM, 75 GSM & 70 GSM</p><p>Grade A: 102%-104% Brightness</p><p>HS CODE: 4802.69.0000</p><p>Minimum Order: 1 * 20 ft Container</p><p>Packing Details:</p><p>500 sheets per ream</p><p>5 reams per box (carton)</p><p>&nbsp;</p><p>Loading capacity per 20 ft Container:</p><p>1560 boxes, 7800 reams with pallets per 20 ft container.</p><p>1600 boxes, 8000 reams without pallets per 20 ft container.</p><p>Loading capacity per 40 ft container:</p><p>3,120 boxes, 15600 reams with pallet per 40 ft container.</p><p>3,200 boxes, 16000 reams without pallet per 40 ft container.</p><p>Available Sizes:</p><p>-Multi-purpose Paper&nbsp;A4&nbsp;– 210mm x 297mm, International Size</p><p>-Multi-purpose Paper A3 Copy Paper: 420x 297mm</p><p>-Multipurpose Paper Letter Size: 8.5 x 11-inch 216 x 279 mm</p><p>-Multi-purpose Paper Legal Size: 8.5 x 14-inch 216 x 330 mm</p><p>&nbsp;</p><h2>Specifications of Paper One Copy paper A4 80Gsm:</h2><p>Quality: Imported 100% Virgin Wood Pulp Whiteness = 102-104%,</p><p>Natural White Moisture: 5% Opacity: 95%</p><p>Capability: High Speed Copying, Laser Capable, Inkjet Capable, fax Capable.</p><p>Thickness: 103-110 um</p><p>Surface roughness TS ml/min: 75-175</p><p>Surface roughness BS ml/min: 100-200</p><p>Bending stiffness MD: 110</p><p>Bending stiffness CD: 50</p><p>CIE whiteness: 148 -167</p><p>Cobb Test: 27-33 g/m2 27-33</p><p>&nbsp;</p><p>Key Performance:</p><p>-No jam in photocopy machine</p><p>-No double feed -Stay flat after copying</p><p>-Leave no dust in the copy machine</p><p>-Nice appearance-white and clean</p><p>-Nice touch-smooth and bulky</p><p>-No see through -Print both sides</p><p>-Been developed for: Photocopy Machines, Laser Printers, Ink-jet Printers, fax Machines</p><p>&nbsp;</p><p>Application:</p><ol><li>Photocopy.</li><li>Laser Printing.</li><li>Inkjet Printing</li></ol><p><em>Seven advantages Paper One Copy paper A4 80Gsm:</em></p><p>1. Good feeding effect: Precise control on moisture during production guarantees the flattening of paper in copying and reduces jamming.</p><p>2. Distinct copying: Smooth surface makes for copying of original colors. The copy looks like originals. 3. Being white and bright: with high-quality material and advanced techniques, the paper is high in whiteness and brightnessand improves distinctness in copying.</p><p>4. Longer working life of copy machines: neat cutting reduces the dust in paper. Smooth surface reduces the machines from wearing and maintaining.</p><p>5. Double-copying, and economic: high-quality material makes the paper with good opacity. Double-copying still has good effect.</p><p>6. Excellent moisture-resistant, abrasion resistant and folding endurance 7.Strong strength and elongation, soft, non-toxic .</p><p><a href=\"https://www.globalsources.com/Copy-paper/Paperone-A4-Copy-Paper-1186930669p.htm\" target=\"_blank\" rel=\"noopener\">Paper One Copy paper</a> A4 80Gsm.</p><p>Buy Paper One Copy paper A4 80Gsm 75Gsm And 75Gsm at discount rate with us. We have been well praised by clients worldwide in the tenet of “Premium Quality Copy Paper, Good Will, Perfect Services and Fast Delivery of Office paper products”. <a href=\"/product-category/art-paper-board/\">Art</a> paper is also available.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Paper-One-Copy-paper-0006.jpg"
    ]
  },
  {
    "slug": "paperline-gold-a4-copy-paper",
    "title": "Paperline Gold A4 Copy Paper",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Paperline-Gold-A4-Copy-Paper.jpg",
    "cat": ["copy-paper"],
    "tags": [
      "double-a-copy-paper-a4-80gsm",
      "idea-green-copy-paper-a4-80gsm",
      "idea-work-copy-paper-a4-80gsm",
      "ik-plus-paper-copy-paper-a4-80gsm",
      "ik-yellow-paper-copy-paper-a4-80gsm",
      "paper-one-gold",
      "paperline-gold-a4-copy-paper",
      "typek-a4-copy-paper-80gsm"
    ],
    "excerpt": "<p>BEST FOR USE WITH YOUR</p><p>– Photocopier</p><p>– Laser Printer</p><p>– Fax Machine</p><p>– Ink-jet</p><p>– Copier</p><p>– 2 side copying</p>",
    "desc": "<p>Buy Paperline Gold A4 Copy<a href=\"/\"> Paper</a>. Double A Global Paper Co.,Ltd is a general merchant, an import & export of general goods and an international marketing company, based in Bangkok Thailand. Double A Global Paper Co.,Ltd are a worldwide supplier of PAPERLINE GOLD A4 COPY PAPER since 2016 And In addition to general cargo shipments. We provide correct and proper documentation required to ensure the fastest clearance both import and export.</p><p>PAPERLINE GOLD A4 COPY PAPER 80GSM/75GSM/70GSM<br>– Sheet Size:210mm x 297mm/297mm x 420mm International Paper Standards Size(ISO) A4/A3<br>– Quality: Imported 100% Virgin Wood Pulp<br>– Whiteness: 102-104%,Natural White<br>– Grading: A<br>– Thickness: 106cm<br>– Capability: High Speed Copying 100ppm, Laser Capable,Inkjet Capable, Fax Capable.</p><p>&nbsp;</p><p>EXCELLENT PERFORMANCE DUE TO:<br>– Moisture Control – Makes the sheets stay flat in the copier and enhances run-ability.<br>– Low Dust Content – Minimizing Your copier running cost.<br>– Good Opacity – Double sided copying of the best quality<br>– Smoothness – Improving Printing Quality.<br>– Bulky Sheet – Enhancing smooth run-ability</p><p>BEST FOR USE WITH YOUR<br>– Photocopier<br>– Laser Printer<br>– Fax Machine<br>– Ink-jet<br>– Copier<br>– 2 side copying</p><p>Find other office Copier Paper Photocopy A4 Copy Paper we <a href=\"https://en.wikipedia.org/wiki/Factory\" target=\"_blank\" rel=\"noopener\">produce</a> as below;<br>Size: A4, A3, Letter size(8.5×11),Legal size(8.5×14), 80gsm, 75gsm, 70gsm.<br><a href=\"/product/buy-double-a-a4-copy-paper-80-75-70-gsm/\">Double A copy paper A4 80gsm</a><br>Paperone copy paper A4 80gsm<br>Idea Work copy paper A4 80gsm<br>Idea Green copy paper A4 80gsm<br><a href=\"/product/buy-original-navigator-a4-copy-paper-80gsm/\">Navigator copy paper A4 80gsm</a><br><a href=\"/product/buy-mondi-rotatrim-copy-paper/\">Mondi Rotatrim A4</a> copy Paper 80gsm<br>Typek A4 copy Paper 80gsm<br>Xerox A4 copy paper 80gsm<br>Ik Plus paper copy paper A4 80gsm<br>Ik Yellow paper copy paper A4 80gsm<br>Paperline Copy Paper A4 80gsm<br>Golden Star copy paper A4 80gsm<br><a href=\"/product/buy-copy-laser-paper-80gsm/\">Laser / Copy Paper A4 80gsm</a><br>Chamex Multi copy paper A4 80gsm<br><a href=\"/product/buy-chamex-copy-paper-a4-80gsm/\">Chamex Office</a> copy paper A4 80gsm</p><h2>Packing Details of Paperline Gold A4 Copy Paper</h2><p>1 reams=500 Sheets<br>5 Reams Inside Pack<br>500 Sheets per Ream 5 Reams per Box<br>1560 Boxes per 20ft container (With Pallet)<br>1600 Boxes Per 20ft container (Without Pallet)<br>7800 Reams Total in one 20FCL (With Pallet)<br>8000 Reams Total in one 20FCL (Without Pallet)</p><p>Buy Paperline Gold A4 Copy Paper at factory price. Please check other products <a href=\"/products/\">here.</a></p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Paperline-Gold-A4-Copy-Paper.jpg"
    ]
  },
  {
    "slug": "reflex-ultra-white-a4-paper",
    "title": "Reflex Ultra White A4 Paper",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Reflex-Ultra-White-A4-Copy-Paper-003.jpg",
    "cat": ["copy-paper"],
    "tags": ["reflex-ultra-white-a4-copy-paper-80gsm"],
    "excerpt": "<p>We are able to supply large quantity and best quality copypaper.<br>For 70GSM, A3, A4, B4, B5, 8.5X11″, 16K, 8K are available;<br>For 80GSM, A3, A4, B4, B5, 8.5X11″, 8.5X13″, 8.5X14″, 11X17″ areavailable,<br>75GSM are aslo under production, there are A4, 8.5X11″, 8.5X13″,8.5X14″, and 11X17″.</p>",
    "desc": "<p>Buy Reflex Ultra White A4 Paper. We are trading and manufacturer of all kind of copier paper worldwide. Paper from Farmed Trees<br>High-quality paper renown for its excellent performance and environmental friendly attributes is suitable for photocopies, printing with inkjet and laser printers and offset preprints. Paper, Premium quality for your printing and copying. Double A Global Paper Co.,Ltd Exports Reflex Ultra White A4 paper and other <a href=\"/about-us/\">papers</a> to Asia, Europe, Africa and America.</p><h2>Reflex Ultra White A4 Paper details</h2><p>A3 (297×420 mm.) 500 sheets<br>A4 (210×297 mm.) 40 sheets, 100 sheets, and 500 sheets<br>B4 (257 X 364 mm.) 100 sheets<br>F14 (216 X 356 mm.) 40 sheets, 100 sheets, and 500 sheets. Reflex Ultra White A4 Paper 80GSM For Sale. A premium copy paper available in 500 sheet ream or 2500 sheet carton.</p><p>Size A4<br>Weight (GSM) 80<br>Sheets per pack 500<br>Packs per carton 5<br>More defined blacks and vibrant colors with no extra ink<br>Suitable for everyday printing on both laser and inkjet printers<br>Quality double sided printing<br>Proudly Australian Made<br>PEFC Certified<br>Certified to Climate Active Carbon Neutral<br>CIE Whiteness: 165<br>No paper jams<br>Product Applications:</p><p>Photocopying, laser printing, Inkjet printing, High speed Copying & Printing, Multi-purpose Paper machine/ copier machine, Fax, Digital Copier</p><p>Salient Features:</p><p>– Eco-friendly paper<br>– Precision cut edges for trouble free performance<br>– Dual side printability<br>– Elemental chlorine free<br>– No dust copy paper<br>– High smoothness<br>– Consistent performance<br>– GSM: 70/75/80/85<br>– Size: A4 (210x297mm) / FS<br>– Available in 75GSM (color copier)<br>– Pallet packing also available</p><p>KEY PERFORMANCE:<br>No jam in photocopy machine</p><p>No double feed<br>Stay flat after copying</p><p>Features and Benefits:<br>1. Excellent image clarity & contrast.<br>2. High opacity and thickness.<br>3. High performance for both side printing/ copying.<br>4. Optimized smoothness on both surface.<br>5. Uniform toner/ ink absorption to provide good print evenness.<br>6. Paper dimensionally stable.</p><p><a href=\"https://www.jumia.com.eg/multi-office/\" target=\"_blank\" rel=\"noopener\">Reflex Ultra White A4</a> paper, is a Quality Copy Paper which is Perfect for office uses. Double A Global Paper Co.,Ltd is a general merchant, an import & export of general goods and an international marketing company, based in Bangkok Thailand. Double A Global Paper Co.,Ltd are a worldwide supplier of Reflex A4 COPY PAPER since 2016 And In addition to general cargo shipments. Buy Reflex Ultra White A4 Paper at factory prices.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Reflex-Ultra-White-A4-Copy-Paper-003.jpg"
    ]
  },
  {
    "slug": "carbonless-ncr-copy-paper-for-invoice",
    "title": "Carbonless NCR Copy Paper for Invoice",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Carbonless-Copy-Paper-07.jpg",
    "cat": ["copy-paper"],
    "tags": [
      "blue-black-image-carbonless-copy-paper-for-invoice-book",
      "carbonless-copy-paper-ccp-ncr-paper-cb-cf-cfb",
      "carbonless-copy-paper-ncr-paper",
      "carbonless-copy-paper-for-receipt-printing",
      "carbonless-paper",
      "carbonless-paper-cb-cfb-cf",
      "ncr-paper",
      "order-blue-black-image-carbonless-copy-paper-for-invoice-book",
      "price-of-blue-black-image-carbonless-copy-paper-for-invoice-book",
      "purchase-blue-black-image-carbonless-copy-paper-for-invoice-book"
    ],
    "excerpt": "<p>Carbonless Copy Paper (CCP / NCR Paper) (CB / CF / CFB)</p><p>Blue Black Image Carbonless Copy Paper for Invoice Book consistsof sheets of paper that are coated with micro-encapsulated dyeor ink or a reactive clay. The back of the first sheet is coatedwith micro-encapsulated dye (referred to as a Coated Back or CBsheet). The lowermost sheet is coated on the top surface with aclay that quickly reacts with the dye to form a permanent mark(Coated Front, CF). Any intermediate sheets are coated with clayon top and dye on the bottom (Coated Front and Back, CFB).</p>",
    "desc": "<p>Blue-Black Image Carbonless NCR Copy Paper for Invoice Book is a type of coated paper designed to transfer information written on the front onto sheets beneath.</p><p>Detail Product:</p><p>Blue-Black Image Carbonless Copy Paper for Invoice.</p><p>Substance CB: 48gsm, 50gsm, 52gsm, 55gsm, 60gsm, 70gsm and 80gsm<br>CFB: 50gsm, 52gsm and 55gsm<br>CF: 48gsm, 50gsm, 52gsm, 55gsm, 60gsm, 70gsm and 80gsm<br>Regular Sheet Size 590*890mm, 559*914mm, 594*841mm, 610*915mm, 610*864mm, 610*889mm, 650*1000mm, 700*1000mm and other size<br>Regular Roll Size Width:242-700mm<br>(240mm,241mm,250mm,280mm,330mm,380mm,389mm,430mm,440mm)<br>Length:6000-12000m<br>Pulp Material wood pulp, recycled pulp and mixed pulp<br>Transfer Image 6 Plies<br>Storage Years 10-15 years<br>OEM Available<br>Features</p><p>Printability Good printing adaptability & absorbency of ink, high smoothness<br>Imaging ability Fast image development, good image intensity<br>Aging – resistant Good light durability, good abrasion resistance<br>Dimension stability Good dimension stability, precise overprint and collating<br>Quality and service Stable quality control, excellent after sale service<br>Packing & Delivery<br>(1)Packing: sheets are wrapped with box or kraft paper with pallet. 500 sheets/ream, 25/26/27 reams/pallet.<br>rolls are wrapped with plastic film inside for moisture protection, outside wrapped with corruagated paperboard, then palletized for ocean transport.<br>(2)Delivery: around 30-40 days after order confirmed.</p><p>Carbonless Paper/computer Print Copy Paper<br>Packaging Details:<br>1):241mm 9.5×11″ 1000sheets/box,192box/pallets,20pallets/20’GP<br>2): 381mm 15×11″ 1000sheets/box,132box/pallets,20pallets/20’GP<br>3)Depends customer requirement.</p><h2>Uses of Carbonless NCR Copy Paper for Invoice</h2><p>Carbonless copy paper was first produced by the NCR Corporation, applying for a patent on June 30, 1953. Formerly, the options were to write documents more than once or use carbon paper, which was inserted between the sheet being written upon and the copy. Carbonless paper was used as business stationery requiring one or more copies of the original, such as invoices and receipts. The copies were often paper of different colors (e.g., white original for customer, yellow copy for supplier’s records, and other colors for subsequent copies). Stationery with carbonless copy paper can be supplied collated either in pads or books bound into sets, or as loose sets, or as continuous stationery for printers designed to use it.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Carbonless-Copy-Paper-07.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Carbonless-Copy-Paper-01-600x600-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Carbonless-Copy-Paper-02-600x499-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Carbonless-Copy-Paper-16-600x600-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Carbonless-Copy-Paper-05-600x600-1.jpg"
    ]
  },
  {
    "slug": "colored-printing-paper",
    "title": "Colored Printing Paper",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Colored-Paper.jpg",
    "cat": ["colored-papers"],
    "tags": ["colored-paper"],
    "excerpt": "<p>Construction paper (also called sugar paper) is a tough, coarse,coloured paper. The texture is slightly rough, and the surfaceis unfinished. Due to the source material, mainly wood pulp,small particles are visible on the paper’s surface. It is usedfor projects or crafts.</p>",
    "desc": "<p>Colored Printing Paper for sale. For projects that are out-of-this-world, Astrobrights color <a href=\"/products/\">paper</a>, in mixed carton 5-color assortment, is the perfect choice. Creative geniuses and novices, alike, can create vibrant flyers, brochures, school projects, signs, coupons, posters, and paper crafting. And, since it’s 20% thicker than standard paper, so you can achieve bleed-free results for single and double-sided documents. Display and store your creations with confidence, each sheet is acid and lignin-free, so they won’t Yellow over time. Plus, this color copy paper saves money on pricey full-color ink. Just add black ink! brighter colors. Brighter ideas.</p><h2>Printing cheap A4 Color&nbsp;Copy Paper</h2><ol><li>Professional quality of colored A4 multi printing copy paper</li><li>The uniformity and distribution of pulp fibers in the sheets</li><li>Pulp dyeing colored in light colors, deep colors and cyber colors without fading 4. Nice appearance clean and uniform cutting</li><li>No jam in machine and no double feed</li><li>Stay flat after printing and copying without leave powder</li><li>Nice touch smooth and bulky</li></ol><p>Paper type: bristol board, <a href=\"https://en.wikipedia.org/wiki/A4\" target=\"_blank\" rel=\"noopener\">color paper</a> board<br>Uses: paper bag, advertisement, hand-made, meeting table card<br>Coating: uncoated<br>Compatible printing: inkjet printing<br>Feature: anti-curl<br>Pulp material: mixed pulp<br>Pulp style: virgin pulping<br>Type: chemical-mechanical pulp<br>Place of origin: South Africa<br>Weight: 150gsm<br>Size: 297*210mm<br>Sheets: 50 each color and 10 sheets<br>Cover material: 100gsm art paper with 4C printing<br>Colors: ivory, pink, yellow, blue, green mixed<br>Packing and delivery:<br>Packing details: 50 sheets per OPP bag, 30 bags per carton</p><p>Colored Printing Paper is made from wood, which is made up mainly of white cellulose. Wood also has a lot of a dark substance in it called lignin, which ends up in the paper, too, along with the cellulose. The exposure of lignin to air and sunlight is what turns paper yellow.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Colored-Paper.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Colored-Paper-001-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Colored-Paper-002-1.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Colored-Paper-003-600x515-2.jpg"
    ]
  },
  {
    "slug": "duplex-board-paper",
    "title": "Duplex Board Paper",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Duplex-Board-Paper-006.jpg",
    "cat": ["duplex-board-papers"],
    "tags": [
      "coated-duplex-board",
      "coated-paper-board",
      "duplex-board",
      "duplex-board-paper",
      "hard-board-paper",
      "newsprint-paper",
      "poly-coated-paper-board",
      "sbs-board",
      "white-paper-boards",
      "writing-priting-paper"
    ],
    "excerpt": "<p>Duplex board is a kind of paperboard or cardboard. It is calledduplex board because it is made up of two layers, or plies. …Duplex board used in the food industry is not made from recycledpaper for hygiene reasons, but sometimes waste paper is usedwhen the board is designated for other purposes.</p>",
    "desc": "<p>We are providers of duplex board Paper one side coated that are available in form of rolls and sheets. Offered in both white, gray and white, white duplex boards, these are Widely used and supplied in printing area, single side color printing,then make cartons which are used as packaging, or used in the design, manual products. Duplex board one side coated is a type of boxboard with a glossy coated surface on one side for superior printability. This product is typically used as packaging material for small boxes that require high quality printability.</p><p>Also can be used as a commodity tag, plate and the tap of blister packaging.</p><div>1)&nbsp;Duplex board one side coated&nbsp;is used for carton, box, file folder, courier envelopes converting as</div><p>well as other stationery & packing applications<br>2) Substance: 230-400gsm<br>3) Size: in sheets or in rolls available<br>4) Coating: single side coating with grey back<br>5) Printing: 9 colors offset printable</p><h2>FEATURES</h2><p>1) Professional quality ISO control system</p><p>2) High stiffness ,folding resistance, perfect surface,super white.</p><p>3) Stable ink absorbability and rich printing dots</p><p>4) Top white coated with grey back and white back</p><p data-spm-anchor-id=\"a2700.details.0.i19.5e882ab3ZTMBne\">5) Standard packing and professional exporting services</p><p>We are providers of <a href=\"http://www.ewootrading.com/manufacturing-export/skin-care-3-3-2/\" target=\"_blank\" rel=\"noopener\">Duplex Paper</a> Board that are available in form of rolls and sheets. Offered in both white, gray and white, white duplex boards, these are widely used to create shoe box, cloth box, cereal box, soap box, toothpaste box, and many other packaging uses. The white duplex board is extensively used to prepare fast food box and take-out food box. Our wide range duplex boards are provided as per client specification.</p><p>These products are widely used in the industries and are highly appreciated for its quality and durability. Understanding the needs and requirements of our clients we provide customized solutions to our clients.</p><h2>Products – Duplex Board HWC (Grey Back)</h2><p>S.NO PARAMETERS<br>1 GSM 230 250 260 285 300 320 350 370 400<br>2 Thickness(mm) 0.295 0.323 0.332 0.374 0.390 0.418 0.465 0.490 0.530<br>3 Bulk(cc/gsm 1.25 1.26 1.27 1.30 1.30 1.30 1.32 1.32 1.32<br>4 Moisture(%) 7.0 7.0 7.0 7.5 7.5 7.5/8.0 7.5/8.5 7.5/8.5 7.5/8.5<br>5 Cobb Value(T/B) 35/35 35/35 35/35 35/35 35/35 35/35 35/35 35/35 35/35<br>6 Stiffness MD/CD(Taber) 70/35 80/40 90/45 120/65 130/65 160/75 190/90 210/105 250/125<br>7 Brightness(%) 76 76 76 76 76 76 76 76 76<br>8 Gloss(%) 60/65 60/65 60/65 60/65 60/65 60/65 60/65 60/65 60/65<br>9 SOAT(Sec) 500 500 500 500 500 500 500 500 500<br>10 B.F.(Kg/Cm2) Minimum 15 14 14 14 14 14 14 15 15<br>Tolerance</p><p>GSM : +5%<br>Stiffness : +15%<br>Brightness : +1.0%<br>Caliper : +5.0%<br>Caliper : +5.0%</p><h2>Products – Duplex Board HWC (White Back)</h2><p>S.NO PARAMETERS<br>1 GSM 230 250 260 285 300 320 350 370 400<br>2 Thickness(mm) 0.265 0.288 0.300 0.333 0.350 0.375 0.420 0.450 0.450<br>3 Bulk(cc/gsm 1.15 1.15 1.15 1.16 1.16 1.17 1.20 1.21 1.22<br>4 Moisture(%) 7.0 7.0 7.0 7.5 7.5 7.5/8.0 7.5/8.0 7.5/8.0 7.5/8.0<br>5 Cobb Value(T/B) 35/35 35/35 35/35 35/35 35/35 35/35 35/35 35/35 35/35<br>6 Stiffness MD/CD(Taber) 55/30 70/35 80/40 90/45 100/50 130/65 150/75 170/80 170/80<br>7 Brightness(%) 77 77 77 77 77 77 77 77 77<br>8 Gloss(%) 60/65 60/65 60/65 60/65 60/65 60/65 60/65 60/65 60/65<br>9 SOAT(Sec) 500 500 500 500 500 500 500 500 500<br>10 B.F.(Kg/Cm2) Minimum 16 16 16 16 16 16 16 16 16<br>Tolerance</p><p>GSM : +5%<br>Stiffness : +15%<br>Brightness : +1.0%<br>Caliper : +5.0%<br>Caliper : +5.0%<br>Duplex board Paper is a cheaper version of white board; it also provides different textures for printing. Used in food packaging as recycled materials cannot be used for this purpose. We have due to our focus on quality of products, customization, process and service levels, and working with various well known companies belonging to industries like engineering, automotive and others.<br>We offer a wide gamut of duplex board boxes that are appropriate for various kinds of printing jobs. These coated duplex boards are perfect for covering of high quality products as their surfaces shiny and dust proof. These boards are coated with high grade material which provides them strength and sturdiness.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Duplex-Board-Paper-006.jpg"
    ]
  },
  {
    "slug": "newsprint-paper-rolls-sheets",
    "title": "Newsprint Paper Rolls/Sheets",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Newsprint-Paper-45gsm-009-1.jpg",
    "cat": ["newsprint-paper"],
    "tags": [
      "2-s-coated-paper-in-reels-sheets",
      "carbonless-paper-in-reels-sheets",
      "divider-sheets",
      "duplex-board-in-sheets",
      "high-quality-fine-paper",
      "kraft-rolls",
      "kraft-sheets",
      "lwc-paper-in-reels",
      "newsprint-in-reels",
      "newsprint-in-sheets",
      "newsprint-paper",
      "newsprint-paper-42gsm",
      "newsprint-paper-452gsm",
      "newsprint-paper-45gsm",
      "newsprint-paper-48-8gsm",
      "pallet-liners",
      "photocopy-paper",
      "slip-sheets",
      "wood-free-paper-in-reels-and-sheets"
    ],
    "excerpt": "<p>The standard diameters of the newsprint are 100 cm, 101.6 cm,125 cm. The paper is produced in accordance with therequirements of the customers within the specification againstthe corresponding inquiries. Such specifications are to beagreed additionally. The reel widths are ranged from 35 cm to200 cm.</p>",
    "desc": "<p>Double A Global Paper Co.,Ltd exports Newsprint Paper Rolls/Sheets 45gsm, 42gsm, 48.8gms, 52gsm. The quality of the newspaper we offer complies with the highest up-to-date standards in the <a href=\"https://en.wikipedia.org/wiki/Newsprint\">printing industry</a>. Therefore, our newsprint is in an increased demand with the large printing houses around the world. Choosing the newsprint made from 100%wood pulp, you solve many issues connected with printing and get a high-quality product in the end. <a href=\"/product/newsprint-paper-rolls-sheets/\">buy newsprint paper online</a></p><p>Find below the detail specification for Newsprint Paper Rolls/Sheets (100% Wood Pulp Newsprint Paper);</p><p>Basic Weight: 42gsm 45gsm, 48.8gsm, 52gsm.</p><p>Size in roll or Size in reel: 760mm, 770mm, 762mm, 781mm, 840mm, 850mm, 860mm, 870mm, 880mm 1260mm, etc</p><p>Size in sheet: 700*1000mm, 787*1092mm, 889*1094mm, also according to customer’s requirements.</p><h2>Newsprint Paper Rolls/Sheets Specification:</h2><p>Parameters 40g 42g 42,5g 45g<br>Furnish TMP – 100%<br>Substance, g/m2 40,0 ± 0,5 42,0 ± 0,5 42,5 ± 0,5 45,0 ± 0,5<br>Caliper, mm max 0,070 max 0,069 max 0,069 max 0,075<br>Density, g/cm3 min 0,59 min 0,61 min 0,61 min 0,61<br>Bulk, cm3/g max 1,70 max 1,63 max 1,63 max 1,66<br>Moisture content, % 8,0 ± 0,5 8,5 ± 0,5 8,5 ± 0,5 8,5 ± 0,5<br>Tear resistance in CD,mN min 230 min 270 min 270 min 280<br>Breaking length, km min 4,80 min 5,00 min 5,00 min 5,00<br>Elongation, % min 0,75 min 0,8 min 0,8 min 0,8<br>Roughness (Bendtsen), ml/min 90±20<br>Porosity (Bendtsen), ml/min max 550 max 500 max 500 max 450<br>Brightness, %, ( R457 C) 60±1<br>Opacity, % min 90 min 90 min 90 min 91<br>Shade a – 0,35 ± 0,15<br>Shade b 3,5 ± 0,5<br>Tolerance limit of reel diameter, mm +10/-30<br>Tolerance limit of reel width, mm ±1<br>Amount of mill joins one per 10 reels</p><p>Parameters 48,8g 52g<br>Furnish TMP – 100%<br>Substance, g/m2 48,8 ± 0,5 52,0 ± 0,5<br>Caliper, mm max 0,081 max 0,087<br>Density, g/cm3 min 0,60<br>Bulk, cm3/g max 1,67 max 1,68<br>Moisture content, % 8,5 ± 0,5<br>Tear resistance in CD,mN min 290 min 300<br>Breaking length, km min 5,00<br>Elongation, % min 0,8<br>Roughness (Bendtsen), ml/min 90±20<br>Porosity (Bendtsen), ml/min max 400 max 350<br>Brightness, %, ( R457 C) 60±1<br>Opacity, % min 93 min 94<br>Shade a – 0,35 ± 0,15<br>Shade b 3,5 ± 0,5<br>Tolerance limit of reel diameter, mm +10/-30<br>Tolerance limit of reel width, mm ±1<br>Amount of mill joins one per 10 reels</p><h2>Feature Newsprint Paper:</h2><p>Standard weight, tensile and tear strength<br>surface strength<br>not lining; Sheet surface smooth,<br>delicate</p><p>End-use application:<br>Suitable for high-speed rotary printing<br>offset printing press of paper<br>like newspaper, magazine book printing</p><p>Packing: In Sheets or Roll/reel, inside is plastic film and outside is art coated paper, or other required packing way. Size: Core diameter is 7.6cm; width is 70 and 74 centimeter, diameter 115 cm.</p><p>Our goal at <a href=\"/\">Double A Global Paper CO.,LTD</a> is to offer products like <a href=\"/product/buy-chamex-copy-paper-a4-80gsm/\">Chamex Copy Paper A4 80GSM</a>, Copy / Laser Paper&nbsp;A4 80GSM, Bleached Softwood Kraft Pulp (BSKP), Brown Kraft Paper Rolls & Sheets (Pure Wood Pulp), JK A4 Copier Paper 75 GSM,&nbsp;Double A Copy Paper&nbsp;A4 (80/75/70 GSM), <a href=\"/product/buy-double-a-a4-copy-paper-80-75-70-gsm/\">Double A Copy Paper</a> A4 (80/75/70 GSM),&nbsp;Thermal Paper Rolls&nbsp;(Cash Register Paper), <a href=\"/product/buy-original-navigator-a4-copy-paper-80gsm/\">Original Navigator Copy Paper A4</a> 70/75/80gsm,&nbsp;JK A4 Copier Paper&nbsp;75 GSM, Art Paper Boards, Paper One Copy paper A4 80Gsm and <a href=\"/product/newsprint-paper-rolls-sheets/\">Newsprint Paper</a> 45gsm, 42gsm, 48.8gms, 52gsm Rolls & Sheets.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Newsprint-Paper-45gsm-009-1.jpg"
    ]
  },
  {
    "slug": "soft-tissue-paper-toilet-roll",
    "title": "Soft Tissue Paper/Toilet Roll",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Soft-Tissue-Paper-002.jpg",
    "cat": ["soft-tissue-paper"],
    "tags": [
      "acid-free-tissue-paper",
      "custom-printed-tissue",
      "facial-tissues",
      "paper-towels",
      "soft-tissue-paper",
      "toilet-tissue",
      "wrapping-tissue"
    ],
    "excerpt": "<p>Double A Global Paper Co.,Ltd is a manufacturer of Soft TissuePaper with a super lightweight paper type usually made fromrecycled paper pulp. The term ‘tissue paper‘ covers a wide rangeof different products including paper towels, toilet tissue,facial tissues, wrapping tissue, and many more.</p>",
    "desc": "<p>Double A Global Paper Co.,Ltd is a an exporter of Soft Tissue Paper/Toilet Roll is a very specialized product manufactured from 100% recycled waste paper. It is mainly used for Napkin, Fancy wrapping & packing and Deep Coloring for Decorative papers. We stand in the midst of distinguished tissue paper manufacturers and suppliers based in the Thailand.</p><p>Properties: Key properties are absorbency, basis weight, thickness, bulk (specific volume), brightness, stretch, appearance and comfort.</p><p>We produce Soft Tissue Paper/Toilet Roll and Facial tissue (paper handkerchiefs) of soft, absorbent, disposable paper that is suitable for use on the face.</p><h2>Specifications of Soft Tissue Paper/Toilet Roll</h2><p>1. Modern factory<br>2. Soft Bathroom Tissue<br>3. Flexible toilet roll</p><p>Pulp Toilet Roll&nbsp; <a href=\"https://www.alibaba.com/trade/search?spm=a2700.galleryofferlist.0.0.6fe0358cAGflp2&IndexArea=product_en&SearchText=Soft_Tissue_Paper%2FToilet_Roll&page=3&f0=y\" target=\"_blank\" rel=\"noopener\">tissue</a> paper<br>roll paper, toilet paper:<br>1. free of paper powder<br>2. easily dissolved in water<br>3. better water absorption and tensile strength</p><h2>Our advantages of our tissue paper</h2><p>1) comfortable and environment-friendly product<br>2) scientific and safe sterilization<br>3) factory direct sale, various design, good quality, fair prices.<br>4) strict quality control<br>5) can be customized as your requirement toilet paper</p><p>Acid free tissue is ideal for wrapping clothing, albums and other keepsakes before storage or transport because it is free of the acids that cause deterioration over time and damage the items it is in contact with. Our premium tissue is a translucent, thin tissue paper is ideal for wrapping and cushioning items. Many retailers use tissue to wrap delicate merchandise in folded or crumpled layers of tissue paper to protect it before placing it in bags or boxes for the customer.</p><p>Description: Luxe very fine soft translucent paper stock. super thin</p><p>GSM: 18gsm or 25gsm</p><p>Form: Sheets and Rolls</p><p>Print: Custom Print Available 1 or 2 color.</p><p>-We have 12 years experience of Facial Tissue Paper manufacturing, this is our expert product.<br>-We have 2 x auto converting lines of Soft Luxury Facial Tissue Paper product with log-saw and auto packing machines, large volume manufacturing ability for cost saving and quality keeping.<br>-The tissue have enough wet-strength material so it is ultra-absorbent.<br>-Made from 100% wood pulp raw material. Ultra-soft tissue, soft tissue standard, or made from mixed material for cost saving.<br>-We can manufacture wood pulp material tissue with FSC certificated documents.<br>-Or we can use mixed material for cheap choice.<br>-Our take care of the each sheets’quality.</p><p><a href=\"/products/\">Check other products here</a>.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Soft-Tissue-Paper-002.jpg",
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Soft-Tissue-Paper-003-600x599-1.jpg"
    ]
  },
  {
    "slug": "thermal-paper-rolls-cash-register",
    "title": "Thermal Paper Rolls Cash Register",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Thermal-Paper-Rolls-00011.jpg",
    "cat": ["thermal-paper-rolls"],
    "tags": ["cash-register-paper", "thermal-paper-rolls"],
    "excerpt": "<p>We are a Thailand based company that manufactured and exportCash Register Paper. Thermal paper (sometimes referred to as anaudit roll) is a special fine paper that is coated with amaterial formulated to change color when exposed to heat. It isused in thermal printers, particularly in inexpensive orlightweight devices such as adding machines, cash registers, andcredit card terminals.</p>",
    "desc": "<p>Double A Global Paper Co.,Ltd is a Thailand based company that manufactured and export Cash Register Paper. Thermal Paper Rolls Cash Register should be stored in a dark place at a relative humidity between 45 percent and 65 percent and a temperature below 77°F to assure satisfactory performance for at least three years from the date of manufacture.</p><p>Application:<br>Blood testing<br>Eye testing<br>Count testing machines<br>R&D machines<br>ATM machines<br>Weighing machines</p><p>1.) Continuous Computer Form is used for office, bank, invoice and documents printing application<br>2.) Base Paper: woodfree paper(single ply) and IK Plus Copy Paper(multi ply)<br>3.) Ply: 1-6 ply OEM<br>4.) Multi-ply image: blue or black<br>5.) Substance: 48-80gsm for multi ply<br>6.) Size: 241mm,381mm and OEM available<br>7.) Packing sheets: 500-2000 sets OEM<br>8.) Colour: white, pink, yellow, blue, green</p><p>Products features:<br>1.) Professional quality control system<br>2.) Brand OEM available<br>3.) Packing box in plain or printed OEM<br>4.) Single ply and multi ply up to 6 ply at buyer’s option<br>5.) Standard export packing</p><p>Offer Pre-Printed, OBM or OEM Service, Customize size for reference for <a href=\"https://www.telepaper.com/products/thermal-cash-register-paper-roll/\" target=\"_blank\" rel=\"noopener\">Thermal Pape</a>r Roll Wholesale:</p><h2>Thermal Paper Rolls Cash Register Specifications</h2><p>Item Size Packaging Plastic /Honeycomb /Paper core<br>Thermal Paper Rolls 80x80mm 50 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 80x70mm 50 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 80x60mm 50 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 80x50mm 50 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 80x40mm 50 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 76x76mm 50 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 76x70mm 100 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 57x60mm 100 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 57x50mm 100 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 57x40mm 100 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Roll 57x30mm 100 Roll/CTN 13x17mm/13x19mm/13x22mm<br>Thermal Paper Rolls 44x70mm 100 Roll/CTN 13x17mm/13x19mm/13x22m<br>Packing: 5-10 rolls/shrink wrapping by plastic foil, golden foil or Silver foil if necessary, 75-100 rolls/case, or customized packing<br>Shrink wrapping; individual packing; OEM packing;<br>Natural packing in waterproof bag</p><p>Packaging Details: <span class=\"do-entry-item-val\">50rolls/box, 100rolls/box or as customers requirements.</span></p><p><a href=\"/contact-us/\">Contact</a> us for more details.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Thermal-Paper-Rolls-00011.jpg"
    ]
  },
  {
    "slug": "unbleached-stuffing-paper",
    "title": "Unbleached Stuffing Paper",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Unbleached-Stuffing-Paper-003.jpg",
    "cat": ["unbleached-stuffing-paper"],
    "tags": [
      "unbleached-stuffing-paper",
      "how-to-buy-unbleached-stuffing-paper",
      "order-unbleached-stuffing-paper",
      "price-of-unbleached-stuffing-paper",
      "purchase-unbleached-stuffing-paper",
      "where-to-buy-unbleached-stuffing-paper"
    ],
    "excerpt": "<p>Double A Global Paper Co.,Ltd is a renowned Supplier ofUnbleached Stuffing Paper in the market. Our qualitative rangeof Unbleached Stuffing Paper is widely in demand by our clientsas it is known for quality and excellent performance. TheUnbleached Stuffing Paper that we provide features perfectfinish and smooth texture.</p>",
    "desc": "<p>Unbleached Stuffing<a href=\"https://www.alibaba.com/product-detail/Customized-BBQ-Paper-Brown-Unbleached-Butcher_1600154015030.html?spm=a2700.galleryofferlist.normal_offer.d_title.248769c6bUvtYd\" target=\"_blank\" rel=\"noopener\"> Paper</a> is a paper most commonly used to print newspapers, and other publications and advertising material. It is designed for use in printing presses that employ a long web of paper (web offset, letterpress and flexographic) rather than individual sheets of paper. It is favored by publishers and printers as it is relatively low cost (compared with paper grades used for glossy magazines and sales brochures), strong (to run through modern high-speed web printing presses) and can accept four-color printing at qualities that meet the needs of typical newspapers.</p><h2>Unbleached Stuffing Paper Specifications:</h2><p>– Size: 70*36, 78*44, 97*54, 107*44, 107*54 mm</p><p>– Booklet size: Small, medium, 1 1/4, king slim, king, super king</p><p>– Paper weight: 14-24gsm</p><p>– Packing: booklet pack</p><p>– Booklet packing: 32 leaves/booklet</p><p>– Packing details: 22 booklets per box, 40 boxes per carton</p><p>– Ultra thin and transparent</p><p>– Slow burning rate and nice taste</p><p>– Surface flat and smooth</p><p>– Special paper size or packing acceptable</p><p>It is considered environmental friendly. We are the renowned Supplier in the market. Our qualitative range of Stuffing Paper is widely in demand by our clients as it is known for quality and excellent performance. The Stuffing Paper that we provide features perfect finish and smooth texture.</p><p>Contact us with your full information of what you need and we will get back to you with a reply in less than 24 hours.</p><h2>Introduction</h2><p style=\"font-weight: 400;\" data-spm-anchor-id=\"a2700.details.0.i20.417c3d26ZUxULU\">* Works Better Than Foil; Ultra durable and strong, this paper is stronger than foil and does a better job at trapping in smoke while releasing steam to prevent soggy foods<br>* Unbleached, Unwaxed and Uncoated; Using only the finest virgin pulps, this paper is made without any waxes, bleaches orunnatural coating that might tamper with your food<br>* Multipurpose Usage; Use this durable 40# weight paper for serving, storing, cooking and smoking meats<br>* Reinforced to Prevent Breakage; Treatment on the interior of the paper ensures that this paper’s wet strength will be enhanced to stop leaking and breakage.<br>* Food Grade; This paper roll is 100 percent food grade certified to ensure safety.</p><p data-spm-anchor-id=\"a2700.details.0.i20.417c3d26ZUxULU\">View more products <a href=\"/products/\">here</a>.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Unbleached-Stuffing-Paper-003.jpg"
    ]
  },
  {
    "slug": "writing-and-printing-paper",
    "title": "Writing and Printing Paper",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Writing-Printing-Paper-001.jpg",
    "cat": ["writing-printing-paper"],
    "tags": [
      "bond-paper",
      "cedar-digital-paper",
      "chromo-art-paper",
      "coated-art-paper",
      "colour-paper",
      "copier-paper",
      "creamwove-paper",
      "excel-bond-paper",
      "file-board",
      "imported-art-paper",
      "ledger-paper",
      "maplitho-paper",
      "news-print",
      "pigmented-paper",
      "writing-printing-paper"
    ],
    "excerpt": "<p>Double A Global Paper Co.,Ltd has a paper production lines withmain products of copy paper, offset paper, art paper, ivoryboard, carbonless paper, color paper and LWC paper,PE coatedpaper,Duplex board,etc.</p><p data-spm-anchor-id=\"a2700.details.0.i24.2e5e6274mThBLi\">We&nbsp;have&nbsp;successfully&nbsp;developed&nbsp;some&nbsp;big&nbsp;brand&nbsp;customers&nbsp;such&nbsp;as&nbsp;METRO,&nbsp;WAL-MART,&nbsp;K-MART,&nbsp;ES-POWER&nbsp;and&nbsp;other&nbsp;large&nbsp;customers&nbsp;and&nbsp;distributors&nbsp;in&nbsp;many&nbsp;parts&nbsp;of&nbsp;the&nbsp;end&nbsp;supermarkets&nbsp;and&nbsp;printing&nbsp;factories&nbsp;in&nbsp;the&nbsp;world.</p><p>Printing and writing papers are paper grades used fornewspapers, magazines, catalogs, books, notebooks, commercialprinting, business forms, stationeries, copying and digitalprinting. About 1/3 of the total pulp and paper marked (in 2000)is printing and writing papers.</p>",
    "desc": "<p>Double A Global Paper Co.,Ltd is an exporter of Writing and Printing Paper. We are keeping stocks in both sheet and reel forms as well as are indenting directly with the mills as per our customer’s need and requirements.</p><p>Our paper is mostly used for printing of Note Books, Text Books, Dictionaries, Calendars, Diaries, Pamphlets, Catalogues, Brochures, Annual Reports, Magazines, News papers, Invitation Cards, Tickets, Computer Stationary, Letter Heads, Envelopes, Digital Printing, Offset printing, Office Files, Other Office & School paper stationary etc.<br>Provide a wide range of paper variety at one stop. We are always committed towards customer satisfaction & believe in providing excellent quality, competitive price and in time delivery.</p><h2>Specifications of Writing and Printing Paper</h2><p>Basis Weight 50g to 120g<br>Size Range<br>Reel: 400mm≤Width≤2200mm<br>Core 3″, 4″ & 6″<br>OD Max 1800mm<br>Sheet: Min 350mm*600mm<br>Max 2200mm*1600mm<br>Height of pallet 1150mm<br>Production Schedule About two rounds monthly<br>Certificates ISO9001, ISO14000, ISO18000, SGS, FSC</p><p>WRITING AND PRINTING PARAMETERS</p><p>S.NO PATRICULARS UNIT ROYAL PREMIUM CRYSTAL<br>1 Substance gm/m2 (+/- 2.5)% (+/- 2.5) % (+/- 2.5) %<br>2 Thickness micron 78.6 78.6 104<br>3 Bulk cc/gm 1.3 1.3 1.3<br>4 Brightness % 72 (+/-1) 80 (+/-1) 85 (+/-1)<br>5 Opacity % 90+ 90+ 90+<br>6 Smoothness<br>T/S ml/min 80-90 60-70 60-70<br>W/S ml/min 100 100 90<br>Porosity ml/min 130 110 110<br>7 Breaking Length (min)<br>MD meters 3800-4000 3900-4200 4000-4500<br>CD meters 2000-2400 2100-2400 2200-2500<br>8 Tear Factor<br>MD – 50-55 55-60 55-60<br>CD – 60-65 65-70 65-70<br>9 Sizing (Cobb 60)<br>T/S g/m2 22 22 21<br>W/S g/m2 23 23 22<br>Wax Pick No. 8A 9A 11A<br>Moisture % 4.5 4.5 4.5<br>Writing Printing <a href=\"https://www.knam.in/writing-printing-maplitho/\" target=\"_blank\" rel=\"noopener\">Paper</a> is smooth surface sized paper which is produced from high bright pulp. It has high tensile strength and suitable for high speed multi color printing.</p><p>Please kindly click <a href=\"/about-us/\">here</a> to know more about our Company.</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Writing-Printing-Paper-001.jpg"
    ]
  },
  {
    "slug": "xerox-multipurpose-a4-paper",
    "title": "Xerox Multipurpose A4 Paper",
    "image": "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Xerox-Multipurpose-Copy-Paper.jpg",
    "cat": ["copy-paper"],
    "tags": ["xerox-multipurpose-copy-paper"],
    "excerpt": "<p>Brand: Xerox multipurpose Copy Paper A4 80GSM (Original)<br>Ream box :5 Ream<br>Sheet in Ream :500<br>Copy Paper be Double Side<br>Copying 100ppm, Laser Capable, Inkjet Capable , Fax Capable<br>Capability: High Speed<br>Natural White</p>",
    "desc": "<p>Xerox Multipurpose A4 Paper 80GSM (Original) Wholesale. Premium quality Copy <a href=\"https://www.alibaba.com/product-detail/A4-Copy-Paper-70-75-80_1600109873513.html?spm=a2700.galleryofferlist.normal_offer.d_title.2f563aa8vaeDqq\" target=\"_blank\" rel=\"noopener\">Paper</a> and printing paper at competitive prices. Make your <a href=\"/contact-us/\">Order</a> today. <span data-spm-anchor-id=\"a2700.details.0.i20.4d334d0etRlpql\">We are suppliers of best quality A4 copy paper 80gsm,75gsm,70gsm and looking for serious buyers in need of our papers contact with us for more details.</span></p><div><div id=\"h5bom\"><p><strong><u>Size</u></strong><br><strong>International standard&nbsp;</strong><br>A4: 210 x 297mm<br>A3: 420 x 297mm<br>8.5 x 11-inch (216 x 279mm)<br>8.5 x 14-inch (216 x 330mm)</p><p><strong><u>Key Performance</u></strong><br>– No jam in photocopy machine<br>– No double feed<br>– Stay flat after copying<br>– Leave no dust in the copy-machine<br>– Nice appearance-white and clean<br>– Nice touch-smooth and bulky<br>– No see through-print both sides<br>– Been developed for : Photocopy Machines, Laser Printers, Ink-jet Printers, Fax Machines</p><p><strong><u>Features and Benefits</u></strong><br>– Perfect for high-quality printing and copying<br>– Super high whiteness produces outstanding clarity and contrast for all graphics and text<br>– Precision-cut edges for trouble-free performance<br>– User-friendly box design with built-in handle for easy carrying, tear slot perforation for easy access to the reams and label for filing</p><h2><u>Outstanding Packaging of Xerox Multipurpose A4 Paper</u></h2><p>– Standout/Premium<br>– Special Protective/Moisture – Proof Wrapper<br>– Economic box<br>– 500 Sheets per Ream 5 Reams per Box<br>– 1560 Boxes per 20ft container (With Pallet)<br>– 1600 Boxes Per 20ft container (Without Pallet)<br>– 7800 Reams Total in one 20FCL (With Pallet)<br>– 8000 Reams Total in one 20FCL (Without Pallet)</p></div></div><p>Gramage: 80gsm, 75gsm, 70gsm<br>Quality: Imported 100% Natural Wood Pulp<br>Brightness = 102-104%,Natural White<br>Capability: High Speed Copying100ppm, Laser<br>Capable,Inkjet Capable, Fax Capable.</p><p>Thickness: 103-110 um<br>Surface roughness TS ml/min: 75-175<br>Surface roughness BS ml/min: 100-200<br>Bending stiffness MD: &gt;110 Mn<br>Bending stiffness CD: &gt;50 Mn</p><p>CIE whiteness: 148-152 or 152-165<br>Cobb Test: 27-33 g/m2 27-33<br>Two-sided usage gives the paper sheet high opacity.<br>Smooth paper surface makes sharp printing and copying.<br>Moist protected wrapper</p><p>Size:<br>International standard<br>A4: 210 x 297mm<br>A3: 420x 297mm<br>8.5 x 11-inch (216 x 279mm)<br>8.5 x 14-inch (216 x 330mm)</p><p>Our main paper as below:<br>Whiteness: A grade (102-104%)<br>B grade (98-100% )<br>C grade (94-96% )<br>Weight: 70 gram; 75 gram; 80 gram</p><p>Key Performance:<br>No jam in photocopy machine<br>No double feed<br>Stay flat after copying<br>Leave no dust in the copy-machine<br>Nice appearance-white and clean<br>Nice touch-smooth and bulky<br>No see through-print both sides<br>Been developed for : Photocopy Machines, Laser Printers, Ink-jet Printers, Fax Machines</p><p>Features and Benefits:<br>Perfect for high-quality printing and copying<br>Super high whiteness produces outstanding clarity and contrast for all graphics and text<br>Precision-cut edges for trouble-free performance<br>User-friendly box design with built-in handle for easy carrying, tear slot perforation for easy access to the reams and label for filing</p><p>Outstanding Packaging:<br>Standout / Premium.<br>Special protective / moisture – proof wrapper.<br>Economic box</p><p>&nbsp;</p>",
    "gallery": [
      "https://doubleaglobalpapers.com/wp-content/uploads/2022/04/Xerox-Multipurpose-Copy-Paper.jpg"
    ]
  }
]
